{"id": "CN201911139716.9", "summary": "The invention relates to the field of automatic welding, in particular to a welding fixture for an electric vehicle motor bracket, comprising a base, three sets of positioning and clamping mechanisms and a control unit, three sets of The positioning and clamping mechanisms are symmetrically arranged, the first group is located at the left and right ends of the base, the second group is located at the front and rear ends of the base, and the third group is located in the middle of the first group and the second group; each group of positioning and clamping mechanisms includes two. Each positioning and clamping mechanism includes a positioning part and a clamping part, the positioning part supports the bracket and then clamps through the clamping part, and the control unit controls the clamping part. The welding fixture has a compact structure, Reasonable, high degree of automation, good clamping and fixing effect, the distribution valve controls all the cylinders to act together, ensuring the synchronization of the clamping action, in addition, the rotary connection between the cylinder and the pressure plate is used, and the pressure plate is driven by the expansion and contraction of the cylinder to achieve The synchronous pressing and taking of the workpiece reduces the work of workers and improves the degree of automation and work efficiency.", "text": [{"sentence": "Technical Field: The present invention relates to the field of automatic welding, in particular to a Electric vehicle motor bracket welding fixture.", "label": 0}, {"sentence": "Background technology: With the rapid acceleration of the industrialization process, traditional industries are undergoing transformation and upgrading, and the manufacturing field is changing from labor-intensive With the transition to automation, traditional welding fixtures are operated purely manually by personnel, which has become increasingly unable to adapt to the development requirements of the new situation, and has the problems of difficult work and low work efficiency for workers.", "label": 0}, {"sentence ": "Summary of the invention: The present invention aims to provide a welding fixture for electric vehicle motor brackets, which adopts the expansion and contraction of the cylinder to drive the splint through the rotating shaft to realize the synchronous clamping of the bracket.", "label": 0}, {"sentence ": "In order to solve the above problems, the present invention provides a welding fixture for electric vehicle motor brackets, including a base, a first group of positioning and clamping mechanisms, a second group of positioning and clamping mechanisms, a third group of positioning and clamping mechanisms, and a control unit , the first group of positioning and clamping mechanisms are symmetrically arranged at the left and right ends of the base, the second group of positioning and clamping mechanisms are symmetrically arranged at the front and rear ends of the base, and the third group of positioning and clamping mechanisms Symmetrically arranged in the middle of the first group of positioning and clamping mechanisms and the second group of positioning and clamping mechanisms, each group of positioning and clamping mechanisms respectively includes two positioning and clamping mechanisms, and each positioning and clamping mechanism includes a positioning portion and a clamping portion. , the positioning part includes a support frame and a support plate, the support frame is vertically arranged on the base, and the support plate is arranged on the support frame; the clamping part includes a cylinder, a splint, an upper arm and a support arm, the fixed end of the cylinder is fixed on the support frame, the output end is movably connected with one end of the upper arm, the other end of the upper arm is fixedly connected with the splint, and the splint is arranged on the support plate Above, one end of the support arm is fixed on the support frame, and the other end is movable with the upper arm connected; the control unit includes a distribution valve and a switch, the switch controls the distribution valve, and the distribution valve is connected with the cylinder. ", "label": 0}, {"sentence": "Further, the upper arm includes a horizontal bar and a vertical bar, and the vertical bar is fixed below the horizontal bar. ", "label": 0}, {"sentence": "Further, one end of the crossbar is connected to the cylinder through a rotating shaft, and the other end is fixedly connected to the splint. ", "label": 0}, {"sentence": "Further, the lower part of the vertical rod is connected with the support arm through a rotating shaft. ", "label": 0}, {"sentence": "Further, the support frame and the base are welded and fixed, and the support plate and the support frame are welded and fixed. ", "label": 0}, {"sentence": "Further, the base, support frame, splint, support plate, upper arm, and support arm are all made of steel. ", "label": 0}, {"sentence": "The present invention has the following beneficial effects: the welding fixture has a compact and reasonable structure, a high degree of automation, and a better clamping and fixing effect. The distribution valve controls all the cylinders to act together to ensure the synchronism of the clamping action. In addition, the cylinder and the pressure plate are connected in rotation. All kinds of unexpected situations that come, reduce the work of workers and improve the degree of automation and work efficiency. ", "label": 0}, {"sentence": "Description of Embodiments: The technical solutions in the embodiments of the present invention will be clearly and completely described below in conjunction with the accompanying drawings of the description of the present invention. Obviously, the described embodiments It is only a part of the embodiments of the present invention, but not all of the embodiments. ", "label": 0}, {"sentence": "Based on the embodiments of the present invention, all other embodiments obtained by those of ordinary skill in the art without creative work are protected by the present invention. scope. ", "label": 0}, {"sentence": "In a specific embodiment of the present invention, as shown in Figures 1 to 2, a welding fixture for an electric vehicle motor bracket is specifically disclosed, including a base 1 , The first group of positioning and clamping mechanisms 10, the second group of positioning and clamping mechanisms 11, the third group of positioning and clamping mechanisms 12 and the control unit, the first group of positioning and clamping mechanisms 10 are symmetrically arranged at the left and right ends of the base 1, The two sets of positioning and clamping mechanisms 11 are symmetrically arranged at the front and rear ends of the base 1, and the third group of positioning and clamping mechanisms 12 are symmetrically arranged in the middle of the first group of positioning and clamping mechanisms 10 and the second group of positioning and clamping mechanisms 11. The positioning and clamping mechanisms respectively include two positioning and clamping mechanisms, and each positioning and clamping mechanism includes a positioning portion and a clamping portion. ", "label": 0}, {"sentence": "The positioning part includes a support frame 2 and a support plate 7, the support frame 2 is vertically arranged on the base 1, and the support plate 7 is arranged on the support frame 2; The support frame 2 and the base 1 are welded and fixed, and the support plate 7 and the support frame 2 are welded and fixed. ", "label": 0}, {"sentence": "The clamping part includes a cylinder 5, a splint 6, an upper arm 8 and a support arm 9, the fixed end of the cylinder 5 is fixed on the support frame 2, and the output end is connected to the upper arm One end of 8 is movably connected, the other end of the upper arm 8 is fixedly connected with the splint 6, the splint 6 is arranged above the support plate 7, one end of the support arm 9 is fixed on the support frame 2, and the other end is movably connected with the upper arm 8. ", "label": 0}, {"sentence": "The upper arm 8 includes a horizontal bar 81 and a vertical bar 82, the vertical bar 82 is fixed below the horizontal bar 81, and one end of the horizontal bar 81 It is connected with the cylinder 5 through a rotating shaft, the other end is fixedly connected with the splint 6 , and the lower part of the vertical rod 82 is connected with the support arm 9 through a rotating shaft. ", "label": 0}, {"sentence": "Preferably, the base 1, the support frame 2, the splint 6, the support plate 7, the upper arm 8, and the support arm 9 are all made of steel. ", "label": 0}, {"sentence": "The control unit includes a distribution valve 3 and a switch 4, the switch 4 controls the distribution valve 3, and the distribution valve 3 is connected with the cylinder 5 through the air pipe. ", "label": 0}, {"sentence": "When the present invention is in use, press the switch 4, the switch 4 sends an instruction to the distribution valve 3, the distribution valve 3 controls the 6 cylinders to work at the same time, and the cylinder 5 is in a retracted state When the cylinder 5 drives the upper arm 8 to move upward through the rotating shaft, until the angle between the vertical rod 82 of the upper arm 8 and the support arm 9 is 180°, the splint 6 moves upward under the driving of the upper arm 8, and the gap between the upper arm 8 and the support plate 7 With a large separation, the workpiece is placed on the pallet 7 . ", "label": 0}, {"sentence": "After the workpiece is placed, press switch 4, switch 4 sends a command to distribution valve 3, distribution valve 3 controls 6 cylinders to work at the same time, and the output end of cylinder 5 extends Out, the cylinder drives the upper arm 8 to move downward through the rotating shaft, the angle between the upper arm 8 and the support arm 9 is reduced, and the clamping plate 6 moves downward under the driving of the upper arm 8 until the workpiece is clamped. ", "label": 0}, {"sentence": "The above disclosure is only a preferred embodiment of the present invention. Of course, it cannot limit the scope of the rights of the present invention. Therefore, according to the claims of the present invention The equivalent changes made still fall within the scope covered by the present invention. ", "label": 0}]}
{"id": "CN201921807399.9", "summary": "The utility model discloses a new energy vehicle power battery pack bracket, which includes a frame fixing frame, a battery pack mounting frame, a main beam of the frame, and a frame fixing frame It is fixedly connected with the car frame, the main beam of the bracket is set horizontally, it is fixedly connected with the frame fixing frame, the battery pack mounting frame is connected to the upper end of the main beam of the bracket, the bottom of the battery pack installation frame is provided with a roller group, and the upper end of the main beam of the bracket There is a track matched with the roller set, and the battery pack mounting frame and the main beam of the bracket are positioned by the positioning mechanism. On the premise that the strength meets the design requirements, compared with similar products on the market, the bracket is easy to disassemble and assemble. Only one person can complete the disassembly of the battery pack bracket.", "text": [{"sentence": "Technical field: The utility model belongs to the technical field of battery brackets for new energy vehicles, and in particular relates to a power battery pack for new energy vehicles Bracket.", "label": 0}, {"sentence": "Background technology: In the new energy light passenger, the power battery pack often weighs more than 300kg, and it is very difficult to replace and repair. The disassembly of the power battery pack requires the use of a number of equipment and human resources such as forklifts and jacks. Especially during the product development stage, the power battery pack needs frequent replacement and maintenance, which will cause a lot of waste of manpower and material resources. ", "label": 0}, {"sentence": "So the current design of the power battery pack bracket not only meets the design requirements in terms of stiffness and strength, but also humanized design such as easy disassembly and assembly has gradually become the current design trend.", "label": 0}, {"sentence": "China's utility model patent A bracket for a new energy vehicle battery (publication number: CN208797055U) discloses a bracket for a new energy vehicle battery, including a base, a battery cell body And the top plate, the interior of the base is provided with an installation groove, and the bottom of the inner wall of the installation groove is fixedly connected with a casing, the top of the casing is movably connected with a movable rod, and the top of the movable rod is fixedly connected with a fixed plate, the fixed plate is Both sides are movably connected with L-shaped plates. The utility model relates to the technical field of battery cell brackets for new energy vehicle batteries. The bracket is provided with an installation groove through the interior of the base, and a casing is fixedly connected to the bottom of the inner wall of the installation slot, and the electric core is fixed on the bottom of the installation groove. Reinforcement, when in use, improve the protection of the cell so that it is not easy to break. A third spring is fixedly connected to the bottom of the L-shaped plate, and the cell is fixed by double fixing, which can improve the power supply. The fixation and stability of the core can make it easier to operate when it is placed; the utility model focuses on the stability of the bracket, but it does not involve a sliding mechanism, which is not easy to disassemble.", "label": 0 }, {"sentence": "Chinese invention patent A new energy vehicle battery combination bracket (public number: CN109360 914A) discloses a new energy vehicle battery combination bracket in the technical field of automotive battery brackets, including a box body, the upper end of the box body is provided with a matching cover plate. Activate the telescopic rod so that the first baffle and the second baffle fix both sides of the battery pack, then turn the screw, and the moving slider makes the pressure plate fix the battery pack through the insert rod, thereby realizing the fixation of battery packs of different sizes , the shock-absorbing device at the bottom has a shock-absorbing effect on the battery pack, avoiding damage to the battery pack caused by vibration, and the through holes on the box body facilitate the dissipation of heat inside the battery pack; the invention has a novel structure, through a simple structure, its side The key point is that the bracket can easily fix the battery combinations of different sizes, which is not suitable for the disassembly and assembly involved in the present invention. ", "label": 0}, {"sentence": "Content of the invention: The purpose of this utility model is to aim at the above-mentioned deficiencies of the prior art, to provide a new energy vehicle power battery pack bracket, which can ensure the installation firmness and structure. Reliable and easy to disassemble. ", "label": 0}, {"sentence": "In order to solve the above technical problems, the technical solution adopted by this utility model is: a new energy vehicle power battery pack bracket, including a frame fixing frame and a battery pack mounting frame and a bracket main beam, the frame fixing frame is fixedly connected to the vehicle frame, the bracket main beam is arranged horizontally, and is fixedly connected with the frame fixing frame, and the battery pack mounting frame is connected to the upper end of the bracket main beam , the bottom of the battery pack mounting frame is provided with a roller group, the upper end of the main beam of the bracket is provided with a track matched with the roller group, and the battery pack mounting rack and the main beam of the bracket are positioned by a positioning mechanism . ", "label": 0}, {"sentence": "The positioning mechanism includes a positioning plate and a fixing bolt, the cross-section of the positioning plate is U-shaped, and the upper end of the positioning plate is fixedly connected with the battery pack mounting frame, positioning The plate and the support beam are provided with positioning holes that penetrate in the horizontal direction, the support beam is provided with a U-shaped groove, the positioning plate penetrates into the U-shaped groove of the support beam, and the fixing bolts are inserted from the positioning plate. Fix it through the positioning hole on the bracket beam. ", "label": 0}, {"sentence": "The bracket beams are provided with at least two, the rollers are arranged in pairs, and the number is twice that of the bracket beams, and the positioning plate is provided with a sub-section between pairs of rollers. ", "label": 0}, {"sentence": "The end of the roller set is provided with a baffle. ", "label": 0}, {"sentence": "The frame fixing frame is arranged vertically, its cross section is U-shaped, and there are a plurality of screw holes continuously arranged thereon. ", "label": 0}, {"sentence": "The beneficial effects of the present utility model are: the new energy vehicle power battery pack bracket, a sliding roller group is installed between the main beam of the bracket and the battery pack mounting frame; The positioning plate is used for positioning between the beam and the battery pack mounting frame to ensure firm and reliable installation. ", "label": 0}, {"sentence": "On the premise that the strength meets the design requirements, compared with similar products on the market, this bracket is easy to disassemble and assemble, and only one person can complete the battery pack bracket during operation. It does not need to use complex procedures such as forklifts and jacks. ", "label": 0}, {"sentence": "Specific implementation manner: the following specific specific embodiments illustrate the implementation of the present utility model, and those who are familiar with this technology can easily understand the present invention from the content disclosed in this specification. Other advantages and effects of the utility model. ", "label": 0}, {"sentence": "As shown in Figure 1 to Figure 3, a new energy vehicle power battery pack bracket includes a frame fixing frame 1, a battery pack mounting frame 2 and a bracket main beam 3. The frame fixing frame 1 is fixedly connected to the vehicle frame, the support main beam 3 is arranged horizontally, and is fixedly connected to the vehicle frame fixing frame 1 , and the battery pack mounting frame 2 is connected to the support main beam 3 The bottom of the battery pack mounting frame 2 is provided with a roller group 22, the upper end of the main beam 3 of the bracket is provided with a track matched with the roller group 22, and the battery pack mounting rack 2 and the bracket The main beam 3 is positioned by a positioning mechanism. ", "label": 0}, {"sentence": "The positioning mechanism includes a positioning plate 23 and a fixing bolt 5. The cross-section of the positioning plate 23 is U-shaped, and the upper end of the positioning plate 23 is connected to the battery pack mounting frame 2 . Fixed connection, the positioning plate 23 and the bracket main beam 3 are provided with a positioning hole that penetrates horizontally, the bracket main beam 3 is provided with a U-shaped groove, and the positioning plate 23 penetrates into the U-shaped groove of the bracket main beam 3 In the groove, the fixing bolts 5 pass through the positioning holes on the positioning plate 23 and the main beam 3 of the bracket for fixing. ", "label": 0}, {"sentence": "The battery pack mounting bracket 2 is composed of two mounting plates 21, the main beam 3 of the bracket is provided with at least two, and the roller groups 22 are arranged in pairs. The number is twice that of the main beam 3 of the bracket, and the positioning plate 23 is arranged between a pair of roller groups 22 . ", "label": 0}, {"sentence": "The end of the roller set 22 is provided with a baffle 25. ", "label": 0}, {"sentence": "The frame fixing frame 1 is arranged vertically, its cross section is U-shaped, and a plurality of screw holes are continuously provided on it. ", "label": 0}, {"sentence": "The battery pack mounting bracket 2 is mounted on the frame through the frame fixing frame 1, and the frame fixing frame 1 and the bracket main beam 3 are welded together to form the entire The power battery pack bracket provides the bearing function. ", "label": 0}, {"sentence": "Battery pack mount 2 is used to mount battery pack 4. ", "label": 0}, {"sentence": "The roller group 22 provides rolling contact between the battery pack mounting frame 2 and the main beam 3 of the bracket, which is convenient for maintenance workers to disassemble. ", "label": 0}, {"sentence": "The positioning plate 23 is used to fix the relative position of the battery pack mounting bracket 2 and the main beam 3 of the bracket. ", "label": 0}, {"sentence": "After removing the fixing bolts 5, the 300kg power battery pack 4 can be easily pulled out by using the pulley set at the bottom of the battery pack mounting bracket 2 without removing the entire battery pack. The bag bracket uses a forklift to lift and disassemble the surrounding parts and other complicated processes, which is very convenient for a single worker to operate and achieve the purpose of easy disassembly and assembly. ", "label": 0}, {"sentence": "On the premise that the strength meets the design requirements, compared with similar products on the market, this bracket is easy to disassemble and assemble, and only one person can complete the battery pack bracket during operation. It does not need to use complex procedures such as forklifts and jacks. ", "label": 0}, {"sentence": "If words such as first and second are used in this patent to define parts, those skilled in the art should know: first, The use of second is only for the convenience of describing the present invention and simplifying the description, and the above words have no special meaning. ", "label": 0}, {"sentence": "The above shows and describes the basic principles, main features and advantages of the present utility model. ", "label": 0}, {"sentence": "Those skilled in the industry should understand that the present utility model is not limited by the above-mentioned embodiments, and what is described in the above-mentioned embodiments and the specification is only to illustrate the principle of the present utility model, Without departing from the spirit and scope of the present utility model, there will be various changes and improvements in the present invention, and these changes and improvements all fall within the scope of the claimed utility model. ", "label": 0}, {"sentence": "The claimed scope of protection of this utility model is defined by the appended claims and their equivalents. ", "label": 0}, {"sentence": "In the description of the present invention, it should be understood that the terms front, rear, left, right, center, etc. The indicated orientation or positional relationship is based on the orientation or positional relationship shown in the accompanying drawings, and is only for the convenience of describing the present invention and simplifying the description, rather than indicating or implying that the indicated device or element must have a specific orientation, be a specific Therefore, it should not be construed as a limitation on the protection content of the present invention. ", "label": 0}]}
{"id": "CN201610671588.2", "summary": "The invention discloses a drive control method for an AC permanent magnet synchronous motor of a pure electric vehicle, and a control rule library is obtained by testing; the angle signal α of the permanent magnet pole of the motor rotor is detected. ; Calculate the angle signal β of the stator flux linkage; Calculate the actual torque angle value θ of the AC permanent magnet synchronous motor; Find the corresponding maximum set torque angle θij corresponding to the actual load current I and the actual motor speed Ω in the control rule library Adjust the phase and period of inverter thyristor triggering according to the torque angle difference. Also disclosed is a pure electric vehicle AC permanent magnet synchronous motor drive control device. For optimal control, real-time access to the control rule base is used to make the control operation faster and more accurate, the control operation simpler, the system inertia small, and the system more stable.", "text": [{"sentence": "Technical field : The present invention relates to the field of motor control, in particular to a drive control method for an AC permanent magnet synchronous motor of a pure electric vehicle, and also to a drive control device for an AC permanent magnet synchronous motor of a pure electric vehicle, which is suitable for an AC permanent magnet synchronous motor of a pure electric vehicle Control.", "label": 0}, {"sentence": "Background technology: With the development of pure electric vehicle AC permanent magnet synchronous motor control technology, the precision requirements for motor control are also constantly improving.", " label": 0}, {"sentence": "The current control methods are direct torque, field weakening, power factor and other control methods. It has the following disadvantages: (1) The amount of calculation is large, and the real-time performance of the system cannot be satisfied in practical applications; (2) The amplitude of the motor direct-axis current or quadrature-axis current is affected by the motor parameters, and the control accuracy is not high; (3) The inertia of the system is large, and the rotational speed is unstable.", "label": 0}, {"sentence": "Content of the invention: The purpose of the present invention is to solve the above-mentioned problems in the prior art and provide a pure electric vehicle AC The permanent magnet synchronous motor drive control method also provides a pure electric vehicle AC permanent magnet synchronous motor drive control device, which solves the problem when the pure electric vehicle AC permanent magnet synchronous motor adopts control methods such as direct torque, field weakening, and power factor. The problems of large inertia and unstable rotation speed.", "label": 0}, {"sentence": "The above-mentioned purpose of the present invention is achieved by the following technical solutions: a pure electric vehicle AC permanent magnet synchronous motor drive control method, comprising: The following steps: Step 1. Test to obtain the maximum torque angle under the condition of setting the motor speed Ωi and setting the load current Ij as the maximum setting torque angle θij, and establishing the maximum setting torque angle θij and the setting motor speed Ωi, Set the control rule base corresponding to the load current Ij, i is the row number of the control rule base, j is the column number of the control rule base; Step 2, The rotor magnetic pole angle detector is used to detect the angle signal α of the permanent magnet magnetic pole of the motor rotor of the AC permanent magnet synchronous motor in real time; step 3, convert the angle signal of the stator flux linkage according to the phase and period of the three-phase power supply of the AC permanent magnet synchronous motor β; Step 4. Obtain the actual torque angle value θ of the AC permanent magnet synchronous motor according to the difference between the angle signal β of the stator flux linkage and the angle signal α of the permanent magnet pole of the motor rotor; The set load current Ij and the set motor speed Ωi corresponding to the actual load current I and the actual motor speed Ω, and then further find the corresponding maximum set torque angle θij corresponding to the actual load current I and the actual motor speed Ω, and set the The difference between the maximum set torque angle θij corresponding to the actual load current I of the AC permanent magnet synchronous motor and the actual motor speed Ω and the actual torque angle value θ obtained in step 4 is obtained to obtain the torque angle difference; step 6, according to the step 5. The obtained torque angle difference adjusts the phase and period of inverter thyristor triggering, so that the adjusted actual torque angle value θ of the AC permanent magnet synchronous motor is equal to the maximum set torque angle θij obtained in step 5. ", "label": 0}, {"sentence": "A pure electric vehicle AC permanent magnet synchronous motor drive control device, including accelerator pedal, speed regulator, current regulator, trigger pulse generator, battery, Inverter, rotor magnetic pole angle detector, first operation circuit, control rule module, second operation circuit, third operation circuit, accelerator pedal, used for providing a given speed signal to the speed regulator; The difference between the given speed signal input by the accelerator pedal and the actual motor speed Ω input by the first operation circuit is proportionally integrated to form a speed regulation signal, and the speed regulation signal is output to the current regulator; the current regulator is used to convert the speed The speed regulation signal output by the regulator and the actual load current I output by the third arithmetic circuit are proportionally integrated to form a current regulation signal, and the current regulation signal is output to the trigger pulse generator; the trigger pulse generator is used to output according to the current regulator The difference between the current adjustment signal and the torque angle output by the second operation circuit adjusts the initial phase and cycle of the six-phase trigger pulse signal of the six thyristors of the inverter; the battery is used to provide the DC side power supply to the inverter; The inverter is used to provide three-phase inverter power for the AC permanent magnet synchronous motor; the rotor magnetic pole angle detector is used to provide the angle signal α of the permanent magnet magnetic pole of the motor rotor for the first operation circuit and the third operation circuit; the first operation The circuit is used to differentiate the angle signal α of the permanent magnet magnetic pole of the motor rotor to obtain the actual motor speed Ω, and input the actual motor speed Ω to the speed regulator and the control rule module; the control rule module is used to provide according to the first operation circuit. The actual motor speed Ω and the actual load current I provided by the third arithmetic circuit are searched for the corresponding maximum set torque angle θij in the control rule library pre-stored in the control rule module 10 by means of table look-up; The corresponding relationship between the set torque angle θij, the set motor speed Ωi, and the set load current Ij is obtained by testing; the second arithmetic circuit is used to compare the maximum set torque angle θij provided by the control rule module with the third set torque angle θij. The actual torque angle value θ of the AC permanent magnet synchronous motor provided by the operation circuit is obtained by making a difference in the torque angle difference value; the third operation circuit is used to detect the actual load current I in real time, and calculate the angle signal of the stator flux linkage according to the actual load current I β, and the actual torque angle value θ of the AC permanent magnet synchronous motor is obtained according to the difference between the angle signal β of the stator flux linkage and the angle signal α of the permanent magnet poles of the motor rotor. ", "label": 0}, {"sentence": "Compared with the prior art, the present invention has the following beneficial effects: 1. The torque angle of the permanent magnet synchronous motor of the pure electric vehicle is optimally controlled, so that the pure electric Automobile permanent magnet synchronous motor can quickly run at the maximum output torque state under various operating conditions; 2. Establish a control rule library for the maximum output torque angle under various operating conditions (speed, current change), Real-time access to the control rule base makes the control operation faster and more accurate; 3. The decoupling method in other control strategies is abandoned, the control operation is simpler, the system inertia is small, and the system is more stable. ", "label": 0}, {"sentence": "Specific embodiment: the technical scheme of the present invention is further described in detail below in conjunction with the accompanying drawings: a pure electric vehicle AC permanent magnet synchronous motor drive control method, and its control steps are : Step 1. Test to obtain the maximum torque angle under the condition of setting the motor speed Ωi and setting the load current Ij as the maximum setting torque angle θij, and establishing the maximum setting torque angle θij and the setting motor speed Ωi, setting The control rule base corresponding to the load current Ij, i is the row number of the control rule base, j is the column number of the control rule base; according to the AC permanent magnet synchronous motor theory, the output torque and torque angle expressions of the AC permanent magnet synchronous motor As follows: Te=mUE0XdΩssinθ+mU22Ωs(1Xq-1Xd)sin2θ]]> For one AC permanent magnet synchronous motor, with the increase of load current or motor speed, the maximum torque angle will also change, as shown in Figures 2 and 3 shown. ", "label": 0}, {"sentence": "The control rule base is shown in Table 1 below. ", "label": 0}, {"sentence": "Table 1 Control rule base Step 2. Use the rotor magnetic pole angle detector to detect the angle signal α of the permanent magnet magnetic pole of the motor rotor of the AC permanent magnet synchronous motor in real time; Step 3 , Convert the angle signal β of the stator flux linkage according to the phase and period of the three-phase power supply of the AC permanent magnet synchronous motor; Step 4, obtain according to the difference between the angle signal β of the stator flux linkage and the angle signal α of the permanent magnet poles of the motor rotor The actual torque angle value θ of the AC permanent magnet synchronous motor; step 5, in the control rule base, search for the set load current Ij and the set motor speed Ωi corresponding to the actual load current I and the actual motor speed Ω, and then further search and The corresponding maximum set torque angle θij corresponding to the actual load current I and the actual motor speed Ω, and the maximum set torque angle θij corresponding to the actual load current I of the AC permanent magnet synchronous motor and the actual motor speed Ω. 4. The actual torque angle value θ obtained is different to obtain the torque angle difference value; step 6, according to the torque angle difference value obtained in step 5, adjust the phase and cycle of the inverter thyristor triggering, so that the AC permanent magnet synchronous motor after the adjustment The actual torque angle value θ is equal to the maximum set torque angle θij obtained in step 5, so that the AC permanent magnet synchronous motor runs at the maximum output torque state. ", "label": 0}, {"sentence": "Another object of the present invention is to provide a pure electric vehicle AC permanent magnet synchronous motor drive control device, the device includes an accelerator pedal 1, a speed regulator 2 , current regulator 3, trigger pulse generator 4, battery 5, inverter 6, AC permanent magnet synchronous motor 7, rotor magnetic pole angle detector 8, first arithmetic circuit 9, control rule module 10, second arithmetic circuit 11 , the third operation circuit 12, the load 13 and other parts. ", "label": 0},{"sentence": "The connection relationship is: 1. The accelerator pedal 1 is connected to the speed regulator 2, and its function is to provide a given speed signal to the speed regulator 2.", "label": 0}, {"sentence ": "2, the speed regulator 2 is connected with the accelerator pedal 1, the current regulator 3, and the first arithmetic circuit 9 respectively, and the speed regulator 2 uses the given speed signal input by the accelerator pedal 1 and the input of the first arithmetic circuit 9. The difference between the actual motor speed Ω is proportionally integrated to form a speed adjustment signal, and the speed adjustment signal is output to the current regulator 3, which is used to form a negative feedback of the speed and keep the output speed of the AC permanent magnet synchronous motor stable.", "label" : 0}, {"sentence": "3. The current regulator 3 is connected to the speed regulator 2, the third arithmetic circuit 12, and the trigger pulse generator 4, respectively. The current regulator 3 adjusts the speed output by the speed regulator 2. The signal and the actual load current I output by the third operation circuit 12 are proportionally integrated to form a current regulation signal, and the current regulation signal is output to the trigger pulse generator 4, whose function is to form a current negative feedback and maintain the output of the AC permanent magnet synchronous motor to rotate. The stability of the moment.", "label": 0}, {"sentence": "4. The trigger pulse generator 4 is connected with the current regulator 3, the second operation circuit 11, and the inverter 6 respectively, and the trigger pulse generator is connected 4. According to the current adjustment signal output by the current regulator 3 and the torque angle difference output by the second operation circuit 11, adjust the initial phase and cycle of the six-phase trigger pulse signal of the six thyristors of the inverter 6. The six thyristors of the inverter 6 provide a six-phase trigger pulse signal; adjust the phase and period of the six thyristors of the inverter 6 to be turned on in turn.", "label": 0}, {"sentence": "5, battery 5 It is connected to the inverter 6, and its function is to provide the DC side power supply to the inverter 6.", "label": 0}, {"sentence": "6. The inverter 6 is connected to the trigger pulse generator 4, The AC permanent magnet synchronous motor 7 is connected, and its function is to provide three-phase inverter power for the AC permanent magnet synchronous motor 7.", "label": 0}, {"sentence": "7, the AC permanent magnet synchronous motor 7 is respectively It is connected to the load 13 and the rotor magnetic pole angle detector 8, and its function is to provide power to the load 13 and to provide the rotor magnetic pole angle displacement for the rotor magnetic pole angle detector 8.", "label": 0}, {"sentence": " 8. The rotor magnetic pole angle detector 8 is respectively connected with the permanent magnet synchronous motor 7 , the first operation circuit 9 and the third operation circuit 12 , and its function is to provide the first operation circuit 9 and the third operation circuit 12 with the permanent magnet of the rotor of the motor. The angle signal α of the magnetic pole.", "label": 0}, {"sentence": "9; the first arithmetic circuit 9 is respectively connected with the rotor magnetic pole angle detector 8, the rotor The speed regulator 2 and the control rule module 10 are connected, and the first arithmetic circuit 9 differentiates the angle signal α of the permanent magnet magnetic pole of the motor rotor to obtain the actual motor speed Ω, and its function is to provide the actual motor speed for the speed regulator 2 and the control rule module 10. Speed ​​Ω. ", "label": 0}, {"sentence": "10. The control rule module 10 is connected to the first operation circuit 9, the second operation circuit 11 and the third operation circuit 12 respectively. The actual motor speed Ω provided by the arithmetic circuit 9 and the actual load current I provided by the third arithmetic circuit 12 are searched for the corresponding maximum set torque angle θij in the control rule library pre-stored in the control rule module 10 by means of table look-up , its function is to provide the second arithmetic circuit 11 with the maximum set torque angle θij; the corresponding relationship between the maximum set torque angle θij in the control rule library, the set motor speed Ωi, and the set load current Ij is obtained through testing. . ", "label": 0}, {"sentence": "The maximum torque angle under the condition of setting the motor speed Ωi and setting the load current Ij is obtained through the test as the maximum setting torque angle θij, and establishing the maximum setting torque angle θij. The control rule library corresponding to the torque angle θij and the set motor speed Ωi and the set load current Ij. ", "label": 0}, {"sentence": "11. The second arithmetic circuit 11 is connected to the control rule module 10, the third arithmetic circuit 12, and the trigger pulse generator 4. The second arithmetic circuit 11 is connected according to the control rule The maximum set torque angle θij provided by the module 10 is compared with the actual torque angle value θ of the AC permanent magnet synchronous motor provided by the third arithmetic circuit 12 to obtain the maximum set torque angle θij and the actual rotation of the AC permanent magnet synchronous motor. The torque angle difference of the torque angle value θ, the function of the torque angle difference is to provide the trigger pulse generator 4 with an adjustment signal of the θ value. ", "label": 0}, {"sentence": "12. The third operation circuit 12 is connected to the current regulator 3, the second operation circuit 11, and the permanent magnet synchronous motor 7 respectively, and the third operation circuit 12 detects in real time The actual load current I, the angle signal β of the stator flux linkage is calculated according to the actual load current I, and the actual torque of the AC permanent magnet synchronous motor is obtained according to the difference between the angle signal β of the stator flux linkage and the angle signal α of the permanent magnet poles of the motor rotor Angle value θ. ", "label": 0}, {"sentence": "The function is to provide the actual load current I feedback signal for the current regulator 3 and the actual torque angle value θ of the AC permanent magnet synchronous motor for the second operation circuit 11 . ", "label": 0}, {"sentence": "The specific embodiments described herein are merely illustrative of the spirit of the present invention. ", "label": 0}, {"sentence": "A person skilled in the art to which the present invention belongs can make various modifications or additions to the specific embodiments described or replace them in similar ways, but it is not may depart from the spirit of the invention or go beyond the scope defined by the appended claims. ", "label": 0}]}
{"id": "CN201920695371.4", "summary": "The utility model discloses a charging pile for electric vehicles with a heat dissipation structure, which comprises a base, a column and a cross bar, and one side of the upper end of the base is arranged with The fixed box is connected with a transmission structure inside the fixed box, the column is arranged at the top of the fixed box, and the top of the column is welded with a reinforcement column, and the welded cross bar is vertically welded to one side of the reinforcement column, and the reinforcement column is A bearing is attached to the top inner wall of the bearing, a transmission column is arranged at the top of the inner wall of the bearing, and a rotating structure is distributed on one side of the top end of the transmission column. The electric vehicle charging pile with heat dissipation structure is provided with a column, and the column and the reinforcement column are arranged between the column and the reinforcement column. It is a welded integrated structure. When the user needs to shade the top cover, due to the influence of the earth's rotation, the angle of sunlight projected to the top cover changes. The user can set the rotation speed of the motor to rotate at a specified time. In order to ensure that the body can be shaded in real time.", "text": [{"sentence": "Technical field: The utility model relates to the technical field of charging piles for electric vehicles, in particular to a charging pile for electric vehicles with a heat dissipation structure. Pile.", "label": 0}, {"sentence": "Background technology: Charging piles generally provide two charging methods: conventional charging and fast charging. People can use a specific charging card to provide human-computer interaction in the charging pile. Swipe the card on the interface to perform operations such as the corresponding charging method, charging time, cost data printing, etc. The charging pile display screen can display the charging amount, cost, charging time and other data. The charging pile emits a lot of heat inside the user, which needs to be The interior is dissipated through the cooling system to ensure the effective operation of the entire device.", "label": 0}, {"sentence": "The existing charging piles for electric vehicles do not have a good shading function in use, and due to Due to the rotation of the earth, ordinary equipment cannot shade the body in real time. At the same time, due to outdoor use, in bad weather, the shading structure may be damaged. For this reason, we propose a charging pile for electric vehicles with a heat dissipation structure.", " label": 0}, {"sentence": "Content of the invention: The purpose of this utility model is to provide a charging pile for electric vehicles with a heat dissipation structure, so as to solve the problem of the existing charging piles for electric vehicles proposed in the above background technology. It does not have a good shading function in use, and due to the rotation of the earth, ordinary equipment cannot shade the body in real time. At the same time, due to outdoor use, in bad weather, it may cause damage to the shading structure.", "label": 0}, {"sentence": "In order to realize the above-mentioned purpose, the utility model provides the following technical scheme: a kind of electric vehicle charging pile with heat dissipation structure, including base, upright column and cross bar, the upper end side of described base is arranged There is a fixed box, and the inside of the fixed box is connected with a transmission structure, and the column is arranged on the fixed The top of the box, and the top of the column is welded with a reinforcing column, the welded cross bar is vertically welded to one side of the reinforcing column, and the inner wall of the top end of the reinforcing column is fitted with a bearing, and the top of the inner wall of the bearing is arranged with a transmission column, And a rotating structure is distributed on one side of the top of the transmission column, a top cover is arranged on the other side of the rotating structure, an organism is distributed on the upper end of the other side of the base, and a limit plate is distributed on one side of the body, and the limit Embedded grooves are distributed around the outer wall of the plate, and a fixed plate is fixed on the inner side of the limit plate. A negative pressure fan is arranged in the middle of the fixed plate, and a filter plate is arranged on the outer wall of the fixed plate. The outer wall of the limit plate is surrounded by Soldered with connecting piece. ", "label": 0}, {"sentence": "Preferably, the base forms an embedded structure through the embedded groove and the limit disk, and the negative pressure fans are distributed along the center line of the limit disk. ", "label": 0}, {"sentence": "Preferably, the transmission structure includes a motor, a reduction gear set and a connecting rod, and a reduction gear set is connected to the top outer wall of the motor, and the reduction gear set is There are connecting rods in the middle part of the other side. ", "label": 0}, {"sentence": "Preferably, the connecting rods are vertically distributed along the center of the column, and the column and the reinforcement column are welded in an integrated structure. ", "label": 0}, {"sentence": "Preferably, the rotating structure includes a rotating arm, a clamping piece, an electric push rod, a rotating shaft and a fixing slot, and one side of the rotating arm is distributed with clamping The lower end of the clamping piece is arranged with an electric push rod, the connection between the clamping piece and the electric push rod is distributed with a fixing groove, and the other end of the electric push rod is distributed with a rotating shaft. ", "label": 0}, {"sentence": "Preferably, the top cover forms a pulling structure through an electric push rod, a rotating arm and a clamping piece, and the top cover is distributed in an arc shape. ", "label": 0}, {"sentence": "Compared with the prior art, the beneficial effect of the present utility model is: the electric vehicle charging pile with heat dissipation structure is provided with a column, and between the column and the reinforcement column In order to weld the integrated structure, when the user needs to shade the top cover, due to the influence of the earth's rotation, the angle of sunlight projected to the top cover changes. It ensures that the body can be shaded in real time. At the same time, through this structure, the motors in multiple electric vehicle charging piles can be connected in parallel to achieve centralized control, which is convenient for users to operate and use. The entire moving process is controlled by the motor drive. , there is no need for manual adjustment by the user, and the gear ratio in the reduction gear set is 1:30. When the left gear rotates 30 times, the right gear rotates 1 circle to ensure that the entire rotation process is uniform and smooth, ensuring the stability of the entire structure The top cover is distributed in a curved surface. Since the electric vehicle charging pile is used outdoors, in bad weather, such as use in strong winds, the entire top cover may increase wind resistance, resulting in the collapse of the entire device. The rotating structure is used in combination to distribute the top cover vertically to reduce wind resistance and collapse. At the same time, when the user needs to rotate the rotating arm to rotate, the user can turn on the electric push rod, and the electric push rod retracts inward to drive the clamp. The tight piece rotates clockwise along the center of the rotating arm, and the entire top cover rotates along with it, and the entire top cover is distributed in an arc shape. In cloudy and rainy days, the top cover can effectively block rainwater and play a good role in sheltering from rain; The negative pressure fan is distributed along the center line of the limit plate. The entire limit plate is made by stamping, and its surrounding is convex. The limit plate is embedded in the base from the inside, and the limit plate and the base are fixed by screws. Its interior is fixed, which can effectively reduce theft, and when there is a high temperature inside the body, the negative pressure fan can be turned on, and the negative pressure fan can blow out to speed up the air flow rate in the body, which has a good cooling effect. ", "label": 0}, {"sentence": "Specific implementation manner: below in conjunction with the accompanying drawings in the embodiments of the present utility model, the technical solutions in the embodiments of the present utility model are clearly and completely described, obviously, The described embodiments are only some, but not all, embodiments of the present invention. ", "label": 0}, {"sentence": "Based on the embodiments in the present utility model, all other embodiments obtained by those of ordinary skill in the art without creative work are all belonging to the present utility model. scope of protection. ", "label": 0}, {"sentence": "Please refer to Figures 1-5, the utility model provides a technical solution: a charging pile for electric vehicles with a heat dissipation structure, comprising a base 1 and a fixing box 2 , Transmission structure 3, motor 301, reduction gear set 302, connecting rod 303, column 4, reinforcement column 5, cross bar 6, bearing 7, transmission column 8, rotating structure 9, rotating arm 901, clamping piece 902, electric pusher Rod 903, rotating shaft 904, fixing slot 905, top cover 10, body 11, limit plate 12, embedding slot 13, fixing plate 14, negative pressure fan 15, filter plate 16 and connecting piece 17, the upper side of the base 1 is placed There is a fixed box 2, and the inside of the fixed box 2 is connected with a transmission structure 3. The transmission structure 3 includes a motor 301, a reduction gear group 302 and a connecting rod 303, and the top outer wall of the motor 301 is connected with a reduction gear group 302. The reduction gear group A connecting rod 303 is arranged in the middle part of the other side of the 302. The connecting rod 303 is vertically distributed along the center of the column 4, and the column 4 and the reinforcing column 5 are welded in an integrated structure. When the user needs the top cover 10 for sunshade At the time, due to the influence of the earth's rotation, the angle of the sunlight projected to the top cover 10 changes, and the user can set the rotation speed of the motor 301 to rotate at a specified time to ensure that the body 11 can be shaded in real time. In this structure, the electric motors 301 in a plurality of electric vehicle charging piles are connected in parallel to achieve the function of centralized control, which is convenient for users to operate and use. The gear ratio in the group 302 is 1 to 30. When the gear on the left rotates 30 times, the gear on the right rotates once, to ensure that the entire rotation process is uniform and smooth, and to ensure the stability of the entire structure; the column 4 is placed in the fixed box 2 The top of the column 4 is welded with a reinforcing column 5, and a cross bar 6 is welded vertically to one side of the reinforcing column 5, and the inner wall of the top end of the reinforcing column 5 is fitted with a bearing 7, and the top of the inner wall of the bearing 7 is arranged with a transmission Column 8, and a rotating structure 9 is distributed on one side of the top end of the transmission column 8, and a top cover 10 is arranged on the other side of the rotating structure 9. The rotating structure 9 includes a rotating arm 901, a clamping piece 902, an electric push rod 903, and a rotating shaft. 904 and a fixing slot 905, a clamping piece 902 is distributed on one side of the rotating arm 901, an electric push rod 903 is arranged at the lower end of the clamping piece 902, and a fixing slot 905 is distributed at the connection between the clamping piece 902 and the electric push rod 903, The other end of the electric push rod 903 is distributed with a rotating shaft 904. The top cover 10 forms a pulling structure through the electric push rod 903, the rotating arm 901 and the clamping piece 902, and the top cover 10 is distributed in an arc shape. For outdoor use, in bad weather, such as use in strong winds, the entire top cover 10 may increase the wind resistance, resulting in the collapse of the entire device. , reduce wind resistance , reduce the collapse, and when the user needs to rotate the rotating arm 901 to rotate, the user can turn on the electric push rod 903, the electric push rod 903 retracts inward, and drives the clamping piece 902 to rotate clockwise along the center of the rotating arm 901 , the entire top cover 10 rotates along with it, and the entire top cover 10 is distributed in a cambered surface. In cloudy and rainy days, the top cover 10 can effectively block rainwater and play a good role in sheltering from rain; the upper end of the other side of the base 1 is distributed The body 11 has a limit plate 12 distributed on one side of the body 11, embedded grooves 13 are distributed around the outer wall of the limit plate 12, and a fixing plate 14 is fixed on the inner side of the limit plate 12, and the base 1 passes through the embedded groove 13 and the limit The disk 12 forms an embedded structure, and the negative pressure fans 15 are distributed along the center line of the limit disk 12. The entire limit disk 12 is made by stamping, and its periphery is convex, and the limit disk 12 is embedded from the inside. Base 1, the limit plate 12 and the base 1 are fixed by screws, and the internal fixation can effectively reduce theft, and when a high temperature occurs inside the body 11, the negative pressure fan 15 can be turned on by turning on the negative pressure fan 15. Wind, speed up the air flow rate in the body 11, and play a good cooling effect; the middle of the fixing plate 14 is provided with a negative pressure fan 15, and the outer wall of the fixing plate 14 is provided with a filter plate 16, and the outer wall of the limit plate 12 is welded around the outer wall. connecting piece 17. ", "label": 0}, {"sentence": "Working principle: For this type of electric vehicle charging pile with a heat dissipation structure, first drive the new energy vehicle to the electric vehicle charging pile, and then charge the electric vehicle. The gun penetrates into the electric vehicle, and the entire body 11 is turned on. When a high temperature occurs inside the body 11, the negative pressure fan 15 can be turned on, and the negative pressure fan 15 can blow air outwards to speed up the air flow rate in the body 11 and achieve a good cooling effect. As a result, when the body 11 is used outdoors, it may be exposed to the scorching sun, and the body 11 needs to be protected by a sunshade device. When the user needs the top cover 10 for sunshade, due to the influence of the earth's rotation, the sun is projected to the angle of the top cover 10 If the change occurs, the user can rotate the motor 301 at a specified time by setting the rotation speed of the motor 301 to ensure that the body 11 can be shaded in real time. They are connected in parallel to achieve centralized control, which is convenient for users to operate and use. The entire moving process is controlled by the motor 301 without manual adjustment by the user, and the gear ratio in the reduction gear set 302 is 1 to 30. The gear rotates 30 times, and the right gear rotates once to ensure that the entire rotation process is uniform and smooth. Since the electric vehicle charging pile is used outdoors, in bad weather, such as use in strong winds, the entire top cover 10 may increase wind resistance , resulting in the collapse of the entire device, it is necessary to use the transmission structure 3 and the rotating structure 9 in combination to distribute the top cover 10 in a vertical shape to reduce wind resistance and reduce collapse. At the same time, when the user needs to rotate the rotating arm 901, use The user can turn on the electric push rod 903, and the electric push rod 903 shrinks inward, driving the clamping piece 902 to rotate clockwise along the center of the rotating arm 901, and the entire top cover 10 rotates accordingly. Finally, the user checks the charging status of the car. After the completion, the user inserts the charging gun into the body 11, and thus completes the entire use process of the electric vehicle charging pile with the heat dissipation structure. ", "label": 0}, {"sentence": "Although the embodiments of the present invention have been shown and described, those of ordinary skill in the art will Various changes, modifications, substitutions and alterations may be made to these embodiments without departing from the spirit, and the scope of the present invention is defined by the appended claims and their equivalents. ", "label": 0}]}
{"id": "CN201821388545.4", "summary": "The utility model provides a low-leakage and high-strength rotor punch of an electric vehicle permanent magnet motor, referred to as rotor punch 1 for short. The rotor punch adopted by the utility model The sheet is provided with a magnetic steel groove, a connecting belt, a transition arc, a weight reduction hole and a shaft hole. A parabolic transition arc is set inside, so that the force point of the centrifugal force is gathered at the focus of the parabolic transition arc, so as to enhance the strength of the connecting belt and avoid force damage. Under the circumstance of large size and cost, the purpose of reducing magnetic leakage rate, increasing output power, increasing strength and reducing cost is achieved.", "text": [{"sentence": "Technical field: This utility model relates to an electric vehicle The drive motor, specifically, refers to a low-leakage and high-strength rotor punch of an electric vehicle permanent magnet motor that is used to laminate the rotor of an electric vehicle permanent magnet motor.", "label": 0}, {"sentence": "Background Technology: Description: The rotor punching sheet described in this article is a sheet-like, alloy magnetically permeable soft magnetic component that is laminated to form the rotor of the permanent magnet motor of an electric vehicle. The soft magnetic material is a magnetic material with low coercivity and high magnetic permeability. ", "label": 0}, {"sentence": "The through hole in the rotor punching piece with the permanent magnet embedded is called the magnetic steel slot, and the permanent magnet is also called the magnetic steel; refer to the Chinese patent application, a Electric vehicle permanent magnet motor rotor punching sheet 201711501021.1, the rotor punching sheet of the prior art is evenly distributed along the circumference with an octagonal star-shaped magnetic pole ring surrounded by mutually isolated, sixteen magnetic steel grooves, located near the center of the rotor punching sheet. Between two adjacent magnetic steel slots, there is a belt-shaped area for connecting the inner and outer structure of the magnetic pole ring, which is called a connecting belt; the rotor punching pieces are superimposed and embedded in the permanent magnet motor rotor made of magnetic steel. The magnetic field of the permanent magnet is coupled with the rotating magnetic field generated by the winding of the stator coil of the motor and then rotates to perform work. Ideally, the magnetic field lines of the permanent magnet magnetic field of the magnetic steel can best be collected and distributed on the outer ring of the magnetic pole ring, that is, the rotor. At the circumference of the permanent magnet, after passing through the air gap between the rotor and the stator, the magnetic field of the permanent magnet is coupled with the rotating magnetic field of the stator coil winding to the maximum extent, so as to improve the output power of the permanent magnet motor; since the magnetic field is a closed field, the magnetic field Part of the magnetic field lines of the permanent magnet magnetic field of steel will be closed along the centripetal side of the pole ring toward the center of the rotor. This part of the magnetic field lines closed toward the centripetal side is called leakage flux because it does not participate in the coupling work. The ratio of magnetism to the total magnetic field lines is called the leakage rate.", "label": 0}, {"sentence": "In practical applications, the rotor of the permanent magnet motor made of In order to meet the improvement of the output power of the permanent magnet motor, the prior art has the following methods: for example, the shape of the permanent magnet motor is increased, that is, the axial length of the rotor is increased, and the magnetic field is correspondingly increased. The length of the steel and the axial length of the stator, so the disadvantage is that the cost of the permanent magnet motor is increased, and the weight of the permanent magnet motor is increased, and the increase in the weight will increase the operating energy consumption of the electric vehicle; another example, reduce the magnetic leakage rate; Studies have shown that if the width of the connecting strip is narrowed, the leakage rate can be effectively reduced, thereby increasing the output power of the permanent magnet motor without increasing the cost. However, when the permanent magnet motor works, the rotor speed is as high as 12000 rpm/ Minutes, at such a high speed, the centrifugal force generated by the magnetic steel will deform or even damage the rotor cylinder with a narrow connecting band width; in order for the rotor punching piece to have enough strength to withstand the centrifugal force during high-speed rotation, the width is increased. The connecting belt, the widening of the connecting belt makes the magnetic leakage rate of the permanent magnet motor rotor made of the rotor punching sheet of the prior art high; problems and deficiencies. ", "label": 0}, {"sentence": "Content of the invention: In view of the problems and deficiencies existing in the above-mentioned prior art, the rotor punching piece used in this utility model is provided with magnetic steel grooves, connecting belts, transition arcs, reducing For the heavy hole and the shaft hole, the connecting belt of the rotor punching piece is narrowed to reduce the magnetic leakage rate, and a parabolic transition arc is set in the magnetic steel groove connected with the connecting belt, so that the centrifugal force is affected. The force point is gathered at the focal point of the parabolic transition arc to enhance the strength of the connecting belt and avoid force damage, and provide a low-leakage and high-strength rotor punching piece for an electric vehicle permanent magnet motor, which aims to make the electric vehicle The permanent magnet motor can achieve the purpose of reducing the leakage rate, increasing the output power, increasing the strength and reducing the cost without increasing the size and cost. ", "label": 0}, {"sentence": "The purpose of this utility model is achieved in this way: a low-leakage and high-strength rotor punching piece for a permanent magnet motor of an electric vehicle, referred to as a rotor punching piece, said rotor The punching piece is an alloy magnetically permeable soft magnetic component with an insulating paint film and a circular sheet shape on the surface. The rotor punching piece is provided with a magnetic steel groove, a connecting belt, a transition arc, a weight reduction hole and a rotating shaft hole. There are evenly distributed magnetic pole rings in the shape of an octagonal star surrounded by sixteen magnetic steel slots isolated from each other along the circumference. The magnetic steel slots are through holes for embedding magnetic steels with rectangular cross-sections; The arrangement of steel polarity, introducing an imaginary concentric circle concentric with the rotor punch is called an imaginary concentric circle, and the imaginary concentric circle passes through the middle of the magnetic pole ring; the imaginary concentric circle faces one side of the center of the rotor punch It is called the centripetal edge, and the side of the imaginary concentric circle facing the circumferential edge of the rotor sheet is called the centrifugal edge; between the two adjacent magnetic steel slots on the centripetal edge, there is an inner and outer structure for connecting the magnetic pole ring. The strip-shaped area is called the connecting strip; the corners of each intersecting edge of the magnetic steel slot connected to the connecting strip are provided with parabolic transition arcs; the center of the rotor punching piece is provided with an interference fit for the motor shaft The through hole is called the shaft hole; the rotor punching piece is also uniformly distributed with a curved triangle through hole between the magnetic steel slot and the rotating shaft hole, which is called the weight reduction hole; in application, several rotor punching pieces are arranged The rotor iron core is formed by corresponding lamination. After lamination, the shaft hole is used to fix the connection of the rotor shaft, the magnetic steel slot is fixed to carry the magnetic steel, and the two ends of the magnetic steel slot are between the two ends of the magnetic steel. Epoxy resin fillers are arranged in the gap of the motor, thereby forming a permanent magnet rotor of a permanent magnet motor; the permanent magnet rotor movably rotates in the inner cylindrical cavity of the stator provided with coil windings. ", "label": 0}, {"sentence": "Working principle and beneficial effects Because the rotor punching piece is set with a parabolic transition arc in the magnetic steel groove connected to the connecting belt, the centrifugal force generated during operation is reduced. The force point of the ball is gathered at the focal point of the parabolic transition arc, so that the strength of the connecting belt is enhanced to avoid damage by centrifugal force; because the magnetoresistance of the filler is much larger than that of the rotor punching material, the magnetic force line tends to be along the The principle of closing the magnetic path with the smallest reluctance, on the premise that the connecting strip is strengthened by the transition arc, the width of the connecting strip is narrowed, so as to further increase the magnetic force line of the magnetic steel along the closed path of the centripetal edge. Magnetoresistance, reducing magnetic flux leakage and magnetic flux leakage rate; under the action of the dynamic rotating magnetic field of the stator winding, most of the magnetic force lines of the magnetic steel pass through the air gap between the rotor and the stator by the magnetic circuit on the side of the centrifugal side. The rotating magnetic field of the stator winding is coupled and then closed again; the dynamic load test confirms that the connecting band can be narrowed to be smaller than the width of the connecting band in the prior art, and the rotor punching sheet is not damaged by centrifugal force; in summary, by setting the transition The arc structure enhances the strength of the connection belt against centrifugal force damage, so that the permanent magnet motor rotor can reduce the magnetic leakage rate by narrowing the width of the connection belt of the rotor punching piece, so that the permanent magnet motor can be made without increasing the size and cost. , to meet or improve the output power. ", "label": 0}, {"sentence": "Above, the rotor punching sheet used in this utility model is provided with a magnetic steel groove, a connecting belt, a transition arc, a weight reduction hole and a shaft hole. The connecting belt is narrowed to reduce the magnetic leakage rate, and a parabolic transition arc is arranged in the magnetic steel groove connected with the connecting belt, so that the force point of the centrifugal force is gathered at the focus of the parabolic transition arc , The technical scheme of enhancing the strength of the connecting belt to avoid force damage overcomes the problems and deficiencies of high leakage rate, difficult to increase output power, high cost, and easy damage in the prior art, and provides a permanent magnet motor for electric vehicles. Low leakage flux and high strength rotor punching, so that the permanent magnet motor of electric vehicle achieves the purpose of reducing flux leakage rate, increasing output power, increasing strength and reducing cost without increasing the size and cost. ", "label": 0}, {"sentence": "Specific implementation: refer to Figures 1 to 3, a low-leakage and high-strength rotor punching sheet for a permanent magnet motor of an electric vehicle of the present invention, referred to as rotor punching sheet 1. The rotor punching piece 1 is an alloy magnetically permeable soft magnetic member with an insulating paint film and a circular sheet shape on the surface. The rotor punching piece 1 is provided with a magnetic steel groove 11, a connecting belt 12, a transition arc 13, a reducing The heavy hole 14 and the shaft hole 15, wherein the rotor punching piece 1 is evenly distributed along the circumference with an octagonal star-shaped magnetic pole ring 16 surrounded by sixteen magnetic steel slots 11 isolated from each other. The through hole of the magnetic steel 01 with rectangular cross section is embedded; based on the arrangement of the polarities of the magnetic steel 01, an imaginary concentric circle concentric with the rotor punch 1 is introduced, which is called an imaginary concentric circle 17. The imaginary concentric circle 17 passes through the middle of the magnetic pole ring 16; the side of the imaginary concentric circle 17 toward the center of the rotor punch 1 is called a centripetal edge, and the side of the imaginary concentric circle 17 toward the circumferential edge of the rotor punch 1 is called a centrifugal edge; Between the two adjacent magnetic steel grooves 11 on the centripetal side, there is a band-shaped area for connecting the inner and outer structure of the magnetic pole ring 16 , which is called a connecting band 12 ; A parabolic transition arc 13 is provided at the corner of each intersecting side of the magnetic steel slot 11; the center of the rotor punch 1 is provided with a through hole for interference fit with the motor shaft, which is called a shaft hole 15; the rotor punch 1 is in the magnetic Between the steel slot 11 and the shaft hole 15, there are evenly distributed through holes in the shape of a curved triangle, which are called weight-reducing holes 14; in application, a number of rotor punching sheets 1 are correspondingly stacked to form a rotor core, which is stacked. Afterwards, the shaft hole 15 is used for fixedly connecting the rotor shaft, the magnetic steel slot 11 is fixed to carry the magnetic steel 01, and the gap between the two ends of the magnetic steel slot 11 and the two ends of the magnetic steel 01 is provided with The epoxy resin filler 02 thus constitutes the permanent magnet rotor of the permanent magnet motor; the permanent magnet rotor movably rotates in the inner cylindrical cavity of the stator 03 provided with coil windings. ", "label": 0}, {"sentence": "Working principle and beneficial effects Because the rotor punching piece 1 is provided with a parabolic transition arc 13 in the magnetic steel groove 11 connected to the connecting belt 12, the working The force point of the centrifugal force generated at the time is gathered at the focal point of the parabolic transition arc 13, so that the strength of the connecting belt 12 is enhanced to avoid being damaged by centrifugal force; the magnetoresistance rate of the filler 02 is much larger than that of the material of the rotor punch 1 According to the principle that the magnetic field lines tend to close along the magnetic path with the smallest magnetic resistance, on the premise that the connecting strip 12 is strengthened by the transition arc 13, the width of the connecting strip 12 is narrowed, so as to further increase the magnetic field. The magnetic resistance of the magnetic field lines of steel 01 along the closed path of the centripetal edge reduces magnetic flux leakage and reduces the magnetic flux leakage rate; under the action of the dynamic rotating magnetic field of the stator 03 winding, most of the magnetic field lines of the magnetic steel 01 are moved from the side of the centrifugal edge. The magnetic circuit passes through the air gap between the rotor and the stator 03 and is coupled with the rotating magnetic field of the stator winding and then returns to close; the dynamic load test confirms that the connecting strip 12 can be narrowed to be smaller than the width of the connecting strip in the prior art, and The rotor punching piece 1 is not damaged by centrifugal force; in summary, by setting the structure of the transition arc 13, the strength of the connecting belt 12 against centrifugal force damage is enhanced, so that the permanent magnet motor rotor can pass through the narrowing of the connecting belt 12 of the rotor punching piece 1. The width of the motor can reduce the leakage rate, so that the permanent magnet motor can meet or improve the output power without increasing the size and cost. ", "label": 0}]}
{"id": "CN201911341980.0", "summary": "The present invention discloses an easy-to-install charging pile for new energy vehicles, including a charging pile outer casing, a bottom plate and a charging cable. The lower end of the charging pile outer casing is A cavity is opened, the lower end of the cavity is slidably embedded with a sliding box, the bottom plate is fixedly arranged on the lower surface of the sliding box, the upper end of the sliding box is an open end, and two ends of the upper surface of the sliding box are symmetrically opened with a groove, the lower end of the cavity is fixedly provided with a fixed plate, the fixed plate is slidingly matched with the groove, and an internal thread cylinder is arranged between the fixed plate and the cavity through the bearing rotation; through the design of the sliding box, through the worm The meshing with the worm gear can drive the sliding box to slide up and down along the cavity to realize the adjustment of the height of the charging pile, which is convenient to control the lifting height of the charging pile according to the installation position, making it easy to use and not easily soaked in water, and the operation is simple and convenient , Compared with the traditional pouring of cement piers, the installation period is greatly shortened, and the installation is more convenient and efficient.", "text": [{"sentence": "Technical field: The present invention belongs to the technical field of automobile charging piles, and specifically relates to a convenient installation. Charging piles for new energy vehicles.", "label": 0}, {"sentence": "Background technology: Vehicle charging piles are fixed on the ground or walls and installed in public buildings and residential parking lots or charging stations. There are generally two charging methods for car charging equipment: conventional charging and fast charging. People can use a specific charging card to swipe the card on the human-computer interaction interface provided by the charging pile to print the corresponding charging method, charging time, and cost data. and other operations, the charging pile display can display data such as charging amount, cost, charging time, etc.", "label": 0}, {"sentence": "The existing charging piles for new energy vehicles often need to be installed in advance. Cement piers are poured on the ground to increase the height of the charging piles and prevent the water in the charging piles from being damaged due to water on the ground. This installation method has a long installation period and requires technicians to arrange in advance, which is inconvenient for the rapid installation of the charging piles. We propose a charging pile for new energy vehicles that is easy to install.", "label": 0}, {"sentence": "Summary of the invention: The purpose of the present invention is to provide a charging pile for new energy vehicles that is easy to install to solve the above background The existing charging piles for new energy vehicles proposed in the technology often need to pour cement piers on the ground in advance during installation to increase the height of the charging piles and prevent the water on the ground from causing damage to the charging piles. This installation method is installed The cycle is long, which requires technicians to arrange in advance, which is inconvenient for quick installation of charging piles.", "label": 0}, {"sentence": "In order to achieve the above purpose, the present invention provides the following technical solutions: a new energy source that is easy to install. A charging pile for automobiles includes an outer shell of the charging pile, a bottom plate and a charging cable. The lower end of the outer shell of the charging pile is provided with a cavity, and the lower end of the cavity is slidably embedded. There is a sliding box, the bottom plate is fixedly arranged on the lower surface of the sliding box, the upper end of the sliding box is an open end, and two ends of the upper surface of the sliding box are symmetrically provided with grooves, and the lower end of the cavity is fixedly provided with a fixed The fixed plate is slidingly matched with the groove, an internal thread cylinder is rotated between the fixed plate and the cavity through a bearing, and the outer surface of the internal thread cylinder is fixedly sleeved with a worm wheel. The surface is engaged with a worm, and the inner bottom surface of the sliding box is fixedly provided with a screw rod, and the screw rod is connected with the inner thread cylinder by screwing. ", "label": 0}, {"sentence": "Preferably, one end of the worm protrudes from the outer surface of the outer shell of the charging pile through the connecting shaft, and the end of the protruding end is fixedly provided with an inner hexagon nut, The outer surface of the outer shell of the charging pile is provided with a concave edge, and the inner hexagonal nut is matched with the concave edge. ", "label": 0}, {"sentence": "Preferably, the four corners of the inner bottom surface of the sliding box are fixedly provided with limit slide cylinders, and the four corners of the inner top surface of the cavity are fixedly provided with limited position slide columns, so The limit slide cylinder and the limit slide column are slidably matched. ", "label": 0}, {"sentence": "Preferably, a telescopic protective cover is sleeved on the outer surface of the sliding box, and the upper and lower ends of the telescopic protective cover are respectively fixed to the outer shell of the charging pile and the bottom plate connect. ", "label": 0}, {"sentence": "Preferably, a chute is provided on the outer side of the outer shell of the charging pile, and a sliding rod is fixed in the chute, and the outer surface of the sliding rod is The sliding sleeve is provided with a slider, one end of the slider protrudes from the outside of the chute, and the protruding end of the slider and the upper end of the outer side of the outer shell of the charging pile are fixedly provided with two parallel distributed strip plates. The outer surfaces of the strip-shaped plates are fixedly provided with round rods, and the charging cables are wound on the round rods on the outer surfaces of the two strip-shaped plates in an "S" shape. ", "label": 0}, {"sentence": "Preferably, a cylinder is rotatably sleeved on the outer surface of the round rod, and a limit plate is fixed at the end of the round rod. ", "label": 0}, {"sentence": "Preferably, two return springs are provided on the outer surface of the slide bar, and the two return springs are located at the upper and lower ends of the slide bar, respectively. ", "label": 0}, {"sentence": "Compared with the prior art, the beneficial effects of the present invention are: (1) By designing the sliding box, the sliding box can be driven along the It slides up and down with the cavity to adjust the height of the charging pile, which is convenient to control the lifting height of the charging pile according to the installation position, making it easy to use and not easily soaked by water, and the operation is simple and convenient. The installation cycle is shortened, and the installation is more convenient and efficient. ", "label": 0}, {"sentence": "(2) By designing the hexagon socket head cap, it is convenient to rotate the worm through the wrench, and set the limit slide cylinder and limit slide column to ensure the stability of the charging pile , Set up a telescopic protective cover to ensure the smooth sliding of the sliding box and the sliding cavity, set up a strip plate and a round rod, which is convenient for automatic winding of the charging cable, and avoids the wear of the charging cable and the ground, and prolongs the service life of the equipment. ", "label": 0}, {"sentence": "Specific implementation manner: The technical solutions in the embodiments of the present invention will be described clearly and completely below in conjunction with the accompanying drawings in the embodiments of the present invention. Obviously, the described The embodiments described above are only a part of the embodiments of the present invention, but not all of the embodiments. ", "label": 0}, {"sentence": "Based on the embodiments of the present invention, all other embodiments obtained by those of ordinary skill in the art without creative work are protected by the present invention. scope. ", "label": 0}, {"sentence": "Refer to Figures 1 to 5 for examples. The present invention provides a technical solution: a charging pile for new energy vehicles that is easy to install, including a charging pile shell 1, The bottom plate 3 and the charging cable 15, the lower end of the outer shell 1 of the charging pile is provided with a cavity, the lower end of the cavity is slidably embedded with a sliding box 6, the bottom plate 3 is welded and fixed on the lower surface of the sliding box 6, and the upper end of the sliding box 6 is an opening The upper surface of the sliding box 6 is symmetrically provided with grooves 13 at both ends, the lower end of the cavity is welded and fixed with a fixed plate 7, the fixed plate 7 is slidingly matched with the groove 13, and the fixed plate 7 and the cavity are rotated through bearings. An internal thread cylinder 5 is provided, the outer surface of the internal thread cylinder 5 is fixedly sleeved with a worm wheel 12, the outer surface of the worm wheel 12 is engaged with a worm 4, and the inner bottom surface of the sliding box 6 is welded and fixed with a lead screw 8. The internal thread barrel 5 is connected by screw threading, and through the engagement of the worm 4 and the worm wheel 12, the internal thread barrel 5 is driven to rotate, so that the internal thread barrel 5 is threadedly connected with the screw rod 8. The screwed connection will drive the sliding box 6 to slide up and down along the cavity to realize the adjustment of the height of the charging pile, which is convenient to control the lifting height of the charging pile according to the installed terrain, making it easy to use and not easy to be soaked by water. ", "label": 0}, {"sentence": "In this embodiment, one end of the worm 4 protrudes from the outer surface of the outer shell 1 of the charging pile through the connecting shaft, and the end of the protruding end is welded and fixed with a socket head screw. The cap 11 is provided with a concave edge on the outer surface of the outer shell 1 of the charging pile, and the inner hexagon nut 11 is matched with the concave edge. ", "label": 0}, {"sentence": "In this embodiment, the four corners of the inner bottom surface of the sliding box 6 are fixedly provided with a limiting slide cylinder 9, and the four corners of the inner top surface of the cavity are welded and fixed with a limiting slide column 10, The limit slider 9 is slidably matched with the limit slider 10, and the limit slider 9 and the limit slider 10 are arranged to further improve the stability of the sliding box 6 sliding along the cavity, thereby ensuring the stability of the charging pile. ", "label": 0}, {"sentence": "In this embodiment, the outer surface of the sliding box 6 is sleeved with a telescopic protective cover 2, and the upper and lower ends of the telescopic protective cover 2 are respectively connected with the charging pile outer shell 1 and The bottom plate 3 is fixedly connected, and a telescopic protective cover 2 is provided to prevent external dust and impurities from adhering to the outer surface of the sliding box 6, so as to ensure that it slides smoothly with the sliding cavity. ", "label": 0}, {"sentence": "In this embodiment, a chute 16 is opened on the outer side of the outer shell 1 of the charging pile, and a sliding rod 17 is fixed in the chute 16, and the outer side of the sliding rod 17 is The surface sliding sleeve is provided with a sliding block 18, one end of the sliding block 18 protrudes from the outside of the chute 16, and the extended end of the sliding block 18 and the upper end of the outer side of the outer shell 1 of the charging pile are welded and fixed with two parallel distributed The strip-shaped plate 14, the outer surface of the strip-shaped plate 14 is welded and fixed with evenly spaced round rods 19, and the charging cable 15 is wound on the round rods 19 on the outer surface of the two strip-shaped plates 14 in an "S" shape, charging the charging cable 15. The cable 15 is wound around the outer surface of the round rod 19. Under the action of gravity, the strip-shaped plate 14 and the slider 18 at the lower end slide down along the sliding rod 17, and the interval between the two strip-shaped plates 14 is increased, thereby realizing For the winding of the charging cable 15, when in use, hold and pull the charging gun at the end of the charging cable 15, and the charging cable 15 is pulled, which in turn drives the strip plate 14 at the lower end to slide up along the sliding rod 17, and then Plug in the charging gun to charge it. ", "label": 0}, {"sentence": "In this embodiment, the outer surface of the round rod 19 is rotatably sleeved with a cylinder 20, and the end of the round rod 19 is welded and fixed to the limiting plate 21, and a circular The cylinder 20 is convenient for the charging cable 15 to drive the cylinder 20 to roll, which greatly reduces the frictional resistance when the charging cable 15 is pulled. ", "label": 0}, {"sentence": "In this embodiment, the outer surface of the slide bar 17 is slidably sleeved with two return springs, and the two return springs are located at the upper and lower ends of the slide bar 17, respectively, A return spring is provided to limit the sliding of the strip plate 14 located at the lower end, so as to avoid excessive pulling of the charging cable 15 to cause damage to the device. ", "label": 0}, {"sentence": "The working principle and use process of the present invention: By setting the sliding box 6, when installing the charging pile, firstly connect the base plate 3 to the ground through expansion screws, and then use a wrench to connect the base plate 3 to the ground. Rotate the inner hexagon nut 11, and then drive the worm 4 to rotate, through the meshing of the worm 4 and the worm wheel 12, drive the internal thread cylinder 5 to rotate, so that the internal thread cylinder 5 and the screw 8 are threadedly connected. The cavity is slidably matched, so the screw connection of the inner threaded barrel 5 and the screw rod 8 will drive the sliding box 6 to slide up and down along the cavity to realize the adjustment of the height of the charging pile, which is convenient to control the lifting of the charging pile according to the installed terrain. Compared with the traditional pouring cement pier, the installation period is greatly shortened, making the installation more convenient and efficient; by setting the hexagon socket head cap 11, the adjustment is more labor-saving , and the inner hexagon nut 11 is embedded in the concave edge, does not occupy the external space, improves the aesthetics of the surface of the charging pile, and the limit slide cylinder 9 and the limit slide column 10 are provided, which further improves the sliding of the slide box 6 along the cavity. To ensure the stability of the charging pile, the strip plate 14 and the round rod 19 are arranged, and the charging cable 15 is wound around the outer surface of the round rod 19. Under the action of gravity, the strip plate 14 at the lower end and the sliding The block 18 slides down along the sliding rod 17, and the interval between the two strip-shaped plates 14 increases, thereby realizing the winding of the charging cable 15. When in use, hold and pull the charging gun at the end of the charging cable 15. The charging cable 15 is pulled, which in turn drives the strip plate 14 at the lower end to slide up along the slide bar 17, and then insert the charging gun for charging. After charging, the charging cable 15 can be automatically wound up without manual winding. In addition, the wear and tear caused by dragging the charging cable 15 on the ground is avoided, the service life of the equipment is prolonged, and the limit plate 21 is provided to limit the charging cable 15 to prevent it from slipping. ", "label": 0}, {"sentence": "Although embodiments of the present invention have been shown and described, it will be understood by those of ordinary skill in the art that Various changes, modifications, substitutions and alterations may be made to these embodiments under circumstances, and the scope of the present invention is defined by the appended claims and their equivalents. ", "label": 0}]}
{"id": "CN201410571403.1", "summary": "An AC induction electric vehicle charging pile, including: a control unit, a power shunt module, a controllable switch device module, a metering module, a temperature measurement module, an isolation sensor It is characterized in that: the control unit is connected with the power distribution module, the AC power supply is connected with the power distribution module, and N controllable switch device modules, metering modules, temperature measurement modules, and isolated inductive plug The connector male plugs are connected in sequence, the N controllable switching device modules, the metering module and the temperature measuring module are respectively connected to the control unit, the power distribution module is connected to the controllable switching device module, the control unit, the power distribution module, the controllable switching device module, The metering module is installed in the cabinet.", "text": [{"sentence": "Technical field: The present invention relates to an electric vehicle charging pile, in particular to an AC induction type electric vehicle charging pile.", "label": 0}, {"sentence": "Background technology: With the increasingly serious environmental pollution caused by automobile exhaust, the popularization of electric vehicles is imperative.", "label": 0}, {"sentence": "Currently , There are few electric vehicle charging piles on the market, and they are not popular, which is also a factor restricting the development of electric vehicles; the few charging piles are to convert alternating current into direct current and then use contact contact with the battery of electric vehicles. Connect the charging, or use the combination of the charger and the charging pile to charge. In this way of combining the charger and the charging pile, the charger should be placed indoors, connected to the charging pile through a DC wire, and the charging pile will be charged with the battery through the wire. , these methods cannot be used with gas stations and gas stations; it is not safe even in parking lots and other environments, because this contact-type contact plug will have an arc once it is plugged in and unplugged; the size of the contact area cannot be Control, it is easy to heat and arc when the current is large; the separation of the charger and the charging pile will increase the cost of the equipment; there will be greater loss on the longer DC wire, and the longer the wire, the greater the loss; when there are multiple charging heads If there is a charging head for charging, the entire high-power alternating current must be converted into direct current, which will cause energy waste.", "label": 0}, {"sentence": "The present invention can provide an alternating current charging It not only has no electrical contact contacts, but also has a relatively simple internal structure of the electric vehicle charging pile.", "label": 0}, {"sentence": "Summary of the invention: The purpose of the present invention is to provide an AC charging pile. Induction type electric vehicle charging pile.", "label": 0}, {"sentence": "In order to achieve the above purpose, the technical solution adopted by the present invention is: an AC induction type electric vehicle charging pile, comprising: a control unit, The power shunt module can control the switch device module, the metering module, the temperature measurement module, the isolation inductive plug connector, and the cabinet." , "label": 0}, {"sentence": "It is characterized in that: the control unit is connected to the power distribution module, the AC power supply is connected to the power distribution module, and N controllable switching device modules, metering modules, measuring The temperature module and the male plug of the isolated induction plug connector are connected in sequence, the N controllable switch device modules, the metering module and the temperature measurement module are respectively connected to the control unit, the power distribution module is connected to the controllable switch device module, the control unit, the power distribution module , The controllable switch device module and the metering module are installed in the cabinet. ", "label": 0}, {"sentence": "According to the AC induction electric vehicle charging pile, it is characterized in that: the control unit includes: a controller, an AC/DC DC power supply, a charging module, Human-machine interface; AC/DC DC power supply is respectively connected with the controller, charging module and human-machine interface, and the controller is respectively connected with the charging module and human-machine interface. ", "label": 0}, {"sentence": "According to the AC induction type electric vehicle charging pile, it is characterized in that: the power shunt module includes: an air switch, a leakage protector, and a shunt terminal block; The AC power supply is connected with the air switch, the air switch is connected with the leakage protector, the leakage protector is connected with the shunt terminal block, and the shunt terminal block is connected with the AC/DC DC power supply of the control unit. ", "label": 0}, {"sentence": "According to the AC induction type electric vehicle charging pile, it is characterized in that: the controllable switching device module includes: a controllable switching device, a heat sink; The control switch device is connected with the shunt terminal block of the power shunt module, and the control switch device and the temperature measurement module are fixed on the heat sink. ", "label": 0}, {"sentence": "According to the AC induction type electric vehicle charging pile, it is characterized in that: the isolation induction type plug connector includes: a male plug and a female plug. ", "label": 0}, {"sentence": "According to the AC induction type electric vehicle charging pile, it is characterized in that: the N controllable switching device modules, metering modules, temperature measurement modules, isolation The male plugs of the inductive plug connectors are connected in sequence, and N controllable switching device modules, metering modules, and temperature measuring modules are respectively connected with the control unit, and N is one or more. ", "label": 0}, {"sentence": "The beneficial effects of the present invention are: 1. The AC induction electric vehicle charging pile can realize no exposed contacts from the cabinet to the plug connector, and has good safety. ", "label": 0}, {"sentence": "2. This AC induction electric vehicle charging pile is an AC charging pile, with a simple overall structure, low cost, and convenient promotion. ", "label": 0}, {"sentence": "3. This AC inductive electric vehicle charging pile adopts isolated inductive plug connectors, which does not arc and has stable overcurrent. ", "label": 0}, {"sentence": "4. This AC induction electric vehicle charging pile has a cabinet and an isolated induction plug connector, which is convenient for outdoor installation and has good rainproof performance. ", "label": 0}, {"sentence": "5. The isolated inductive plug connector of this AC inductive electric vehicle charging pile can play the role of AC voltage transformation during the charging process, and is multi-purpose. ", "label": 0}, {"sentence": "Figure 1 is a schematic circuit diagram of a single plug connector in the present invention. ", "label": 0}, {"sentence": "Figure 2 is a schematic diagram of the circuit of the multi-plug connector of the present invention. ", "label": 0}, {"sentence": "Figure 3 is a schematic diagram of the structure of the isolated inductive plug connector of the present invention. ", "label": 0},{"sentence": "Fig. 4 is a three-dimensional schematic diagram of the isolated induction plug connector of the present invention.", "label": 0}, {"sentence": "In the accompanying drawings: 1. Power shunt module; 2. Temperature measurement module; 3. Controllable switching device module; 4. Metering module; 5. Isolated inductive plug connector; 6. AC/DC charging module; 7. Battery; 8. Control unit; 51. Isolated inductive plug connector male plug; 52, 81, controller; 82, AC/DC power supply; 83, charging module; 84, man-machine interface; 521, female shell; 522, female core; 523, female coil Sealing shell; 524, female coil winding shell; 525, female plug-in fastening device fixing block; 526, slideway; 511, male coil sealing shell; 512, coil; 513, male coil winding shell; 514, Male insert magnetic core; 515, Male insert shell; 516, Fastening piece; 517, Positioning device; 518, Fixing block for male insertion and fastening device.", "label": 0}, {"sentence": "Detailed implementation Below in conjunction with the accompanying drawings and specific embodiments, the present invention will be further described: the present invention is a kind of AC induction type electric vehicle charging pile, as shown in Figures 1 and 2, comprising: a control unit 8, a power distribution module 1, a controllable switch Device module 3, metering module 4, temperature measurement module 2, isolation inductive plug connector 5, cabinet.", "label": 0}, {"sentence": "It is characterized by: the control unit 8 and the power supply The shunt module 1 is connected, the AC power supply is connected to the power shunt module 1, the N controllable switching device modules 3, the metering module 4, the temperature measurement module 2, and the isolation induction plug connector male plug 51 are connected in sequence, and N controllable switching devices are connected. Module 3, metering module 4, temperature measurement module 2 are respectively connected to control unit 8, power distribution module 1 is connected to controllable switching device module 3, control unit 8, power distribution module 1, controllable switching device module 3, metering module 4 Installed in the cabinet.", "label": 0}, {"sentence": "According to the AC induction type electric vehicle charging pile, it is characterized in that: the control unit 8 includes: a controller 81, AC/DC DC power supply 82, charging module 83, man-machine interface 84; AC/DC DC power supply 82 is respectively connected with controller 81, charging module 83, man-machine interface 84, and controller 81 is respectively connected with charging module 83, man-machine interface 84. ", "label": 0}, {"sentence": "According to the AC induction type electric vehicle charging pile, it is characterized in that: the power shunt module includes: an air switch, a leakage protector, and a shunt terminal block; The AC power supply is connected to the air switch, the air switch is connected to the leakage protector, the leakage protector is connected to the shunt terminal block, and the shunt terminal block is connected to the AC/DC DC power supply 82 of the control unit." , "label": 0}, {"sentence": "According to the AC induction electric vehicle charging pile, it is characterized in that: the controllable switching device module 3 includes: a controllable switching device, a heat sink; The control switching device is connected to the shunt terminal block of the power shunt module 1, and the controllable switching device and the temperature measuring module 2 are fixed on the heat sink. ", "label": 0}, {"sentence": "According to the AC induction type electric vehicle charging pile, it is characterized in that: the isolation induction type plug connector 5 includes: a male plug and a female plug; The male plug 51 is connected to the metering module 4 through a cable. ", "label": 0}, {"sentence": "According to the AC induction type electric vehicle charging pile, it is characterized in that: the N controllable switching device modules 3, measurement modules 4, temperature measurement modules 2. The male plugs 51 of the isolated inductive plug connectors are connected in sequence, and N controllable switching device modules 3, metering modules 4, and temperature measuring modules 2 are respectively connected to the control unit 8, and N is one or more. ", "label": 0}, {"sentence": "The above temperature measurement module 2 is a temperature sensor. ", "label": 0}, {"sentence": "The above controllable switching device is an AC triac. ", "label": 0}, {"sentence": "The following is a further description of the isolated inductive plug connector 5 in conjunction with Figure 3 and Figure 4: the following female insert magnetic core 522 is mountain-shaped, and the male insert magnetic core 514 as a glyph. ", "label": 0}, {"sentence": "The following male fitting block 518 has bolt holes, and the female fitting block 525 has threaded holes. ", "label": 0}, {"sentence": "The following fasteners 516 are bolts. ", "label": 0}, {"sentence": "The following female socket housing 521 and female socket coil sealing shell 523 are integrated. ", "label": 0}, {"sentence": "The following female core 522 and male core 514 are soft cores. ", "label": 0}, {"sentence": "An isolated inductive plug connector 5, including a female plug, a male plug, and a closing device. ", "label": 0}, {"sentence": "It is characterized in that: the female plug is wound with a coil 512 on the female plug coil winding shell 524, and the female plug coil winding shell 524 is installed on the female plug. Inside the plug-in coil sealing shell 523, a wire outlet hole is left on the female plug-in coil winding casing 524. The coil 512, the female plug-in coil sealing casing 523, and the female plug-in coil winding casing 524 are sheathed on the female plug-in magnetic core 522. The coil 512, The female insert magnetic core 522, the female insert coil sealing shell 523, and the female insert coil winding shell 524 are installed in the female insert housing 521, and the female insert housing 521 has a wire outlet hole; the male insert is wound around the male insert coil. The coil 512 is wound on the wire casing 513, the male plug coil winding casing 513 is installed in the male plug coil sealing casing 511, and a wire outlet hole is left on the male plug coil winding casing 513. The coil 512, the male plug coil sealing casing 511, The male plug coil winding shell 513 is sleeved on the male plug magnetic core 514, the coil 512, the male plug magnetic core 514, the male plug coil sealing shell 511, and the male plug coil winding shell 513 are installed in the male plug shell 515, and the male plug shell 515 has a wire outlet hole; when the female plug and the male plug are closed and tightly closed, the female plug magnetic core 522 and the male plug magnetic core 514 form a closed magnetic coil; There are N male inserting device fixing blocks 518 and female inserting tightening device fixing blocks 525 on the female socket housing 521 , the male inserting and tightening device fixing blocks 518 and the female inserting and tightening device fixing blocks 525 are connected by the tightening member 516 . The female ferrule 522 is closed with the male ferrule 514 . ", "label": 0}, {"sentence": "According to the described isolation inductive plug connector, it is characterized in that a slideway 526 is left in the described female plug housing 521. ", "label": 0}, {"sentence": "According to the described isolation induction type plug connector, it is characterized in that: the slideway 526 in the described female plug housing 521 and the male plug housing 515 have positioning device 517. ", "label": 0}, {"sentence": "When the AC inductive electric vehicle charging pile is used, the isolated inductive plug connector female plug 52, the AC/DC charging module 6, and the battery 7 are fixed on the vehicle and isolated The inductive plug-in female plug 52 is connected to the AC/DC charging module 6, and the AC/DC charging module 6 is connected with the battery 7; It is connected with the female plug 52 of the isolated inductive plug connector. When the person pays the fee through the man-machine interface 84 and the charging module 83, the controller 81 controls the input end of the AC triac to communicate with the output end, and the AC power supply passes through the air switch. , leakage protector, shunt terminal block, AC triac, metering module 4, isolated inductive plug connector 5, AC/DC charging module 6 to battery 7, so that the battery 7 can be charged, and the temperature sensor transmits the temperature information to The controller 81, when the temperature is higher than a certain value, the controller 81 controls the input end of the AC triac to disconnect from the output end, when the battery 7 is fully charged, the metering module 4 transmits the information to the controller 81, When the information transmitted by the metering module 4 is smaller than a certain value, the controller 81 controls the input end of the AC triac to disconnect from the output end, and the AC induction electric vehicle charging pile stops charging. ", "label": 0}, {"sentence": "The above-mentioned embodiments are only to describe the preferred embodiments of the present invention, and do not limit the concept and protection scope of the present invention, without departing from the design concept of the present invention. Under the premise of the present invention, various modifications and improvements made by ordinary engineers and technicians in the art to the technical solutions of the present invention shall fall within the protection scope of the present invention. ", "label": 0}]}
{"id": "CN201820194022.X", "summary": "The utility model discloses an electric vehicle charging pile which is easy to install, comprising a base, the base is clamped with a mounting seat through a clamping mechanism, and the clamping The connection mechanism is fixed by a locking mechanism, a height adjustment device is installed on the top of the mounting seat, an angle adjustment device is installed at the end of the height adjustment device, and a charging pile body is installed on the top of the angle adjustment device, which is convenient for installation. The electric vehicle charging pile is assembled with the base and the mounting seat through the clamping mechanism, which is easy to install and disassemble, which greatly improves the installation efficiency of the electric vehicle charging pile. The clamping mechanism is fixed by the locking mechanism, which greatly improves the base. The reliability of the connection between the seat and the mounting seat, the working height of the charging pile body is adjusted through the height adjustment device, and the working angle of the charging pile body is adjusted through the angle adjustment device, which has good flexibility, convenient adjustment, and is convenient for different uses. Demand.", "text": [{"sentence": "Technical field: The utility model relates to the technical field of charging piles, in particular to an electric vehicle charging pile that is easy to install.", "label": 0}, {" sentence": "Background technology: in the prior art: the patent application publication number CN107458262A discloses an electric vehicle charging pile that is easy to install, including a base and a mounting seat, and the top left and right sides of the base are provided with plug-ins, The bottom, left and right sides of the mounting seat are provided with slots, the plug-in is inserted into the interior of the slot, the top of the mounting seat is provided with a sleeve, and the inner cavity of the sleeve is connected with a support column, the The top of the support column is connected with an equipment table, the top of the equipment table is installed with a charging pile, and the outer top of the sleeve is provided with fastening bolts, which need to be locked by adjusting the fastening bolts, which is time-consuming and labor-intensive. At the same time, its flexibility is poor and cannot meet the needs of use.", "label": 0}, {"sentence": "Content of the invention: The technical problem to be solved by this utility model is to overcome the existing defects and provide a convenient installation. The electric vehicle charging pile has high installation efficiency, saves time and labor, has good flexibility, can meet the needs of use, and can effectively solve the problems in the background technology.", "label": 0}, {"sentence": "In order to achieve For the above purpose, the present utility model provides the following technical solutions: an electric vehicle charging pile that is easy to install, including a base, the base is clamped with a mounting seat through a clamping mechanism, and the clamping mechanism is fixed by a locking mechanism, so A height adjustment device is installed on the top of the mounting seat, an angle adjustment device is installed at the end of the height adjustment device, a charging pile body is installed on the top of the angle adjustment device, and an open source single-chip microcomputer is installed on the side of the charging pile body. The input end is electrically connected to the output end of the external power supply.", "label": 0}, {"sentence": "As a preferred technical method of the present invention In this case, the clamping mechanism includes a positioning member and a fastener, the positioning member is fixed on the top of the base, the fastener is fixed on the top of the mounting seat, and the fastener is clamped with the positioning member. ", "label": 0}, {"sentence": "As a preferred technical solution of the present utility model, the locking mechanism includes a locking hole and an electric The electric lock is installed on the side of the positioning piece, the electric lock is inserted into the lock hole, and the output end of the open-source single-chip microcomputer is electrically connected to the input end of the electric lock. ", "label": 0}, {"sentence": "As a preferred technical solution of the present invention, the height adjustment device includes an electric lift rod, and the electric lift rod is installed on the top of the mounting seat. The telescopic end of the rod is fixed with a connection seat, the angle adjustment device is installed on the top of the connection seat, and the output end of the open source single-chip microcomputer is electrically connected to the input end of the electric lifting rod. ", "label": 0}, {"sentence": "As a preferred technical solution of the present utility model, the angle adjustment device includes a servo motor, the servo motor is installed on the top of the connection seat, and the output of the servo motor An installation plate is fixed on the shaft, an infrared sensor is installed on the side of the installation plate, and the charging pile body is installed on the top of the installation plate. The input of the motor. ", "label": 0}, {"sentence": "Compared with the prior art, the beneficial effect of the present utility model is that the electric vehicle charging pile is easy to install, and the base and the mounting seat are connected by the clamping mechanism. It is easy to install and disassemble, which greatly improves the installation efficiency of the electric vehicle charging pile. The clamping mechanism is fixed by the locking mechanism, which greatly improves the reliability of the connection between the base and the mounting seat. The working height of the body is adjusted, and the working angle of the charging pile body is adjusted through the angle adjustment device, which has good flexibility, convenient adjustment, and is convenient to meet different use requirements. ", "label": 0}, {"sentence": "Specific implementation manner: below in conjunction with the accompanying drawings in the embodiments of the present utility model, the technical solutions in the embodiments of the present utility model are clearly and completely described, obviously, The described embodiments are only some, but not all, embodiments of the present invention. ", "label": 0}, {"sentence": "Based on the embodiments in the present utility model, all other embodiments obtained by those of ordinary skill in the art without creative work are all belonging to the present utility model. scope of protection. ", "label": 0}, {"sentence": "Please refer to FIG. 1, the present utility model provides a technical solution: an electric vehicle charging pile that is easy to install, including a base 1, and the base 1 is connected by clamping The mechanism 14 is clamped with a mounting seat 4, the clamping mechanism 14 is fixed by a locking mechanism 17, a height adjusting device 15 is installed on the top of the mounting seat 4, and an angle adjusting device 16 is installed at the end of the height adjusting device 15, and the angle adjusting device A charging pile body 8 is installed on the top of the 16 , an open source single chip 7 is installed on the side of the charging pile body 8 , and the input end of the open source single chip 7 is electrically connected to the output end of the external power supply. ", "label": 0}, {"sentence": "The snap mechanism 14 includes a positioning member 2 and a fastener 3. The positioning member 2 is fixed on the top of the base 1, and the fastener 3 is fixed on the top of the mounting base 4. At the top, the fastener 3 is clamped with the positioning member 2, and the base 1 and the mounting seat 4 are assembled through the clamping connection between the fastener 3 and the positioning member 2. The installation and disassembly are convenient, which greatly improves the installation of the electric vehicle charging pile. efficiency. ", "label": 0}, {"sentence": "The locking mechanism 17 includes a locking hole 12 and an electric locking device 13, the locking hole 12 is opened on the positioning member 2, and the electric locking device 13 is installed on the positioning member 2 The side of the electric locker 13 is inserted into the lock hole 12, the output end of the open-source single chip 7 is electrically connected to the input end of the electric locker 13. The locking hole 12 is inserted to fix the clamping mechanism 14 , which greatly improves the reliability of the connection between the base 1 and the mounting seat 4 . ", "label": 0}, {"sentence": "The height adjustment device 15 includes an electric lift rod 5, the electric lift rod 5 is installed on the top of the mounting seat 4, and the telescopic end of the electric lift rod 5 is fixed with a connecting seat 6, The angle adjusting device 16 is installed on the top of the connecting seat 6 , the output end of the open source single chip 7 is electrically connected to the input end of the electric lifting rod 5 , the open source single chip 7 controls the electric lifting rod 5 to work, and the telescopic end of the electric lifting rod 5 drives the mounting seat 4 The lifting movement is performed to adjust the working height of the charging pile body 8 . ", "label": 0}, {"sentence": "The angle adjustment device 16 includes a servo motor 11, the servo motor 11 is mounted on the top of the connection base 6, and a mounting plate 9 is fixed on the output shaft of the servo motor 11. The mounting plate An infrared sensor 10 is installed on the side of the 9, and the charging pile body 8 is installed on the top of the mounting plate 9. The output end of the infrared sensor 10 is electrically connected to the input end of the open-source single-chip microcomputer 7, and the output end of the open-source single-chip microcomputer 7 is electrically connected to the input of the servo motor 11. At the end, the infrared sensor 10 senses the human body information, and the sensed information is transmitted to the open-source single-chip microcomputer 7, which analyzes and processes the information, and controls the servo motor 11 to work. The operation area of ​​the charging pile body 8 faces the human body, which is convenient for consumers to operate. ", "label": 0}, {"sentence": "The working angle of the charging pile body 8 is adjusted through the angle adjustment device 16, which has good flexibility, is easy to adjust, and is convenient to meet different usage needs. ", "label": 0}, {"sentence": "The open source microcontroller 7 controls the electric locker 13, the electric lift rod 5, the servo motor 11 and the infrared sensor 10 are all commonly used methods in the prior art. ", "label": 0}, {"sentence": "In use: Assemble the base 1 and the mounting seat 4 by snapping the fastener 3 and the positioning piece 2. ", "label": 0}, {"sentence": "The operation of the electric lock 13 is controlled by the open source microcontroller 7, and the electric lock 13 is inserted into the lock hole 12 to fix the clamping mechanism 14. ", "label": 0}, {"sentence": "The electric lifting rod 5 is controlled to work by the open source single-chip microcomputer 7, and the telescopic end of the electric lifting rod 5 drives the mounting seat 4 to move up and down, so as to adjust the working height of the charging pile body 8 Make adjustments. ", "label": 0}, {"sentence": "The infrared sensor 10 senses human body information, and the sensed information is transmitted to the open source microcontroller 7, which analyzes and processes the information, and controls the servo motor 11 to work, the servo The output shaft of the motor 11 drives the mounting plate 9 to rotate, so that the operation area of ​​the charging pile body 8 faces the human body. ", "label": 0}, {"sentence": "The utility model assembles the base 1 and the mounting seat 4 through the clamping mechanism 14, which is convenient for installation and disassembly, and greatly improves the installation efficiency of the electric vehicle charging pile , the clamping mechanism 14 is fixed by the locking mechanism 17, which greatly improves the reliability of the connection between the base 1 and the mounting seat 4, and the working height of the charging pile body 8 is adjusted by the height adjusting device 15, and the angle adjusting device 16 Adjusting the working angle of the charging pile body 8 has good flexibility, is convenient to adjust, and is convenient to meet different usage requirements. ", "label": 0}, {"sentence": "Although the embodiments of the present invention have been shown and described, those of ordinary skill in the art will Various changes, modifications, substitutions and alterations may be made to these embodiments without departing from the spirit, and the scope of the present invention is defined by the appended claims and their equivalents. ", "label": 0}]}
{"id": "CN202021285312.9", "summary": "The utility model discloses a new energy vehicle charging pile charging gun locking structure, which relates to the field of the charging pile charging gun locking structure, aiming at existing new energy vehicle charging piles The charging gun cannot be locked and is easily damaged. The following solution is proposed, which includes a main body pile, a charging equipment frame, a square charging handle, and a charging head. The square charging handle is connected to a socket through a wire, and the main body is provided with There is a push rod motor and a plug is fixedly connected to the output end of the push rod motor, a first rotating drum is rotatably connected in the charging equipment frame, and a positioning rod is fixedly connected to the inner walls of the upper and lower sides of the first rotating drum, so A cylinder is fixedly connected in the frame of the charging equipment, a limit ring is fixedly connected to the outer side of the cylinder, and a pressure sensor is fixedly installed on one side of the limit ring. The dual means of electricity and hardware protection greatly improve the protective characteristics of the device.", "text": [{"sentence": "Technical field: The present utility model relates to the field of locking structures for charging piles and charging guns, in particular to a A new energy vehicle charging pile charging gun locking structure.", "label": 0}, {"sentence": "Background technology: The charging pile is similar in function to the gas dispenser in the gas station. It can be fixed on the ground or wall and installed In public buildings (public buildings, shopping malls, public parking lots, etc.) and residential parking lots or charging stations, various types of electric vehicles can be charged according to different voltage levels.", "label": 0}, {"sentence ": "The input end of the charging pile is directly connected to the AC power grid, and the output end is equipped with a charging plug for charging electric vehicles.", "label": 0}, {"sentence": "The charging pile generally provides conventional charging and There are two charging methods of fast charging. People can use a specific charging card to swipe the card on the human-computer interaction interface provided by the charging pile to perform operations such as corresponding charging method, charging time, and cost data printing. The charging pile display screen can display the charging. Data such as volume, cost, charging time, etc.", "label": 0}, {"sentence": "But the existing charging pile does not have a fixed locking structure. Although it can be closed by powering on and off, it cannot be Effective protection makes it easy to be damaged or damaged.", "label": 0}, {"sentence": "Therefore, a new energy vehicle charging pile charging gun locking structure is proposed.", "label": 0 }, {"sentence": "Content of the invention: The utility model proposes a new energy vehicle charging pile charging gun locking structure, which solves the problem that the existing new energy vehicle charging pile charging gun cannot be locked and is easily damaged." , "label": 0}, {"sentence": "In order to achieve the above Purpose, the utility model adopts the following technical scheme: a new energy vehicle charging pile charging gun locking structure, including a main body pile, a charging equipment frame, a square charging handle, and a charging head, the square charging handle is connected with a socket through a wire, so A push rod motor is arranged in the main body pile and a plug is fixedly connected to the output end of the push rod motor. A first rotating drum is rotatably connected in the charging equipment frame, and the inner walls of the upper and lower sides of the first rotating drum are fixedly connected. There is a positioning rod, a cylinder is fixedly connected in the frame of the charging device, a limit ring is fixedly connected to the outer side of the cylinder, and a pressure sensor is fixedly installed on one side of the limit ring. A second drum is sleeved on the outer side, a spring is connected between the second drum and the pressure sensor, a slideway is arranged on the outer side of the charging head, and an annular chute is opened at the right end of the slideway, and the first The upper and lower sides of a rotating drum are rotatably connected with a rotating rod, and the other end of the rotating rod is rotatably connected with a hydraulic rod. ", "label": 0}, {"sentence": "Preferably, the charging device frame is fixedly installed inside the main body pile, and the charging head is fixedly installed at the left end of the square charging handle. ", "label": 0}, {"sentence": "Preferably, the first drum is rotatably connected to the frame of the charging device through a bearing, and the second drum is arranged in the first drum. ", "label": 0}, {"sentence": "Preferably, the second rotating drum is sleeved on the outside of the cylinder and the limiting ring. ", "label": 0}, {"sentence": "Preferably, a plurality of pressure sensors are fixedly installed on the right side of the limiting ring, and the inner wall on the right side of the second drum and the pressure sensors are connected to each other. A spring is fixedly connected between them. ", "label": 0}, {"sentence": "Preferably, the positioning rod is slidably connected to the chute and the annular chute. ", "label": 0}, {"sentence": "The beneficial effects of the present utility model are: through the main body pile, the charging equipment frame, the square charging handle, the socket, the plug, the first drum, the cylinder, the limit The ring, the second rotating drum, the spring, the charging head, the slideway, the annular chute, the rotating rod, and the positioning rod, so that the device can install the square charging handle and the charging head in the second rotating drum. The upper fixed slideway will mortgage the left-moving compression spring of the second drum, which will then generate pressure on the pressure sensor. The hydraulic rod on the side pushes the rotating rod to drive the first rotating drum to rotate counterclockwise, and then rotate the positioning rod to the front and rear sides of the annular chute to lock and limit the charging head. At this time, the push rod motor retracts and controls the plug and socket to separate. ", "label": 0}, {"sentence": "The device has the characteristics of convenient and further locking control and dual means of power-off and hardware protection, which greatly improves the protection of the device. ", "label": 0}, {"sentence": "Specific implementation manner: below in conjunction with the accompanying drawings in the embodiments of the present utility model, the technical solutions in the embodiments of the present utility model are clearly and completely described, obviously, The described embodiments are only some, but not all, embodiments of the present invention. ", "label": 0}, {"sentence": "Refer to Figure 1-5, a new energy vehicle charging pile charging gun locking structure, including main body pile 1, charging equipment frame 2, square charging handle 3, charging head 11. The square charging handle 3 is connected with the socket 4 through the wire, the main body pile 1 is provided with a push rod motor and the output end of the push rod motor is fixedly connected with the plug 5, the charging equipment frame 2 is rotatably connected with a first drum 6, A positioning rod 15 is fixedly connected to the inner walls of the upper and lower sides of a rotating drum 6, a cylinder 7 is fixedly connected to the charging equipment frame 2, and the outer side of the cylinder 7 is fixedly connected to the limiting ring 8 and the A pressure sensor is fixedly installed on one side, a second drum 9 is sleeved on the outer side of the limiting ring 8, a spring 10 is connected between the second drum 9 and the pressure sensor, and a slideway 12 is provided on the outer side of the charging head 11. The right end of the chute 12 is provided with an annular chute 13 , a rotating rod 14 is rotatably connected to the upper and lower sides of the first drum 6 , and a hydraulic rod is rotatably connected to the other end of the rotating rod 14 . ", "label": 0}, {"sentence": "In this embodiment, the charging device frame 2 is fixedly installed inside the main body pile 1, and the charging head 11 is fixedly installed at the left end of the square charging handle 3. ", "label": 0}, {"sentence": "In this embodiment, the first drum 6 is rotatably connected to the charging device frame 2 through a bearing, and the second drum 9 is arranged in the first drum 6. ", "label": 0}, {"sentence": "In this embodiment, the second rotating drum 9 is sleeved on the outside of the cylinder 7 and the limiting ring 8. ", "label": 0}, {"sentence": "In this embodiment, a plurality of pressure sensors are fixedly installed on the right side of the limiting ring 8, and the right inner wall of the second drum 9 and the pressure sensors are connected to each other. A spring 10 is fixedly connected therebetween. ", "label": 0}, {"sentence": "In this embodiment, the positioning rod 15 is slidably connected in the slideway 12 and the annular slideway 13. ", "label": 0}, {"sentence": "Working principle: When in use, the charging head 11 can be fixedly connected by inserting the square charging handle 3 and the charging head 11 into the second drum 9. The slideway 12 will press the second drum 9 to move the compression spring 10 to the left, thereby generating pressure on the pressure sensor, and as the charging head 11 moves to the left, the positioning rod 15 will gradually slide from the slideway 12 to the annular slide. In the groove 13, when the pressure sensor reaches the rated value, the hydraulic rods on the upper and lower sides will be controlled to push the rotating rod 14 to drive the first rotating drum 6 to rotate counterclockwise, and then the positioning rod 15 will be rotated to the front and rear sides of the annular chute 13. The charging head 11 is locked and limited. At this time, the push rod motor retraction control plug 5 is separated from the socket 4. At the same time, the two-dimensional code can be unlocked to control the hydraulic rod and the reverse operation of the push rod motor to open and use. ", "label": 0}, {"sentence": "The above is only a preferred embodiment of the present utility model, but the scope of protection of the present utility model is not limited to this, any person familiar with the technical field Within the technical scope disclosed by the present utility model, the technical personnel who make equivalent replacements or changes according to the technical solution of the present utility model and its utility model concept shall all be included within the protection scope of the present utility model. ", "label": 0}]}
{"id": "CN201711374333.0", "summary": "The invention discloses an AC/DC charger for electric vehicles, including a controller, a temperature compensation circuit, a power counting circuit, an AC/DC DC output circuit, an auxiliary current circuit, filter circuit, power factor compensation circuit, resonance conversion circuit and battery charge and discharge parameter detection circuit, the controller is respectively connected with temperature compensation circuit, power counting circuit, AC/DC DC output circuit, auxiliary current circuit, filter circuit, power Factor compensation circuit, resonance conversion circuit and battery charge and discharge parameter detection circuit. The present invention uses different algorithms to charge according to different rechargeable battery types, which improves the charging efficiency, prolongs the service life of the battery, and improves the safety of the battery.", " text": [{"sentence": "Technical field: The present invention relates to a charger, specifically an AC and DC charger for electric vehicles.", "label": 0}, {"sentence": "Background technology: The charger is a product under the concept of new energy. It is a power conversion device specially designed for charging battery packs used in electric vehicles, charging piles, charging and swapping stations, power communications, railways, aviation, and wind power storage. The types of design can be divided into lead-acid battery chargers, lithium battery chargers, super capacitor chargers, etc.", "label": 0}, {"sentence": "The charging characteristics of lithium batteries and lead-acid batteries are very similar. The charging parameters can be set according to the voltage and capacity of the battery for charging; while the charging characteristics of super capacitors are quite special, it needs to start charging from DCOV, the charging current is relatively large, and the required maximum charging voltage is about DC850V. It is technically difficult to realize the conversion from DCOV to DC850V high-voltage charging.", "label": 0}, {"sentence": "Supercapacitor chargers generally have two control modes, one is PWM pulse width control. There are two control modes: PWM pulse width control: PWM uses the pulse width (that is, the width and width of the control frequency) to control the output, and the pulse frequency is constant; DCOV can be adjusted , but the efficiency is low, the secondary rectifier diode cannot achieve soft switching conversion, and there will be a spike voltage during reverse recovery. Due to the choice of the device, only low-voltage series can be used.", "label": 0}, {"sentence" : "PFM pulse frequency control: PFM is the change of frequency with and without the presence or absence of the pulse. The output is controlled by the presence or absence of the pulse, and the pulse width is constant; soft switching conversion can be realized, and the conversion efficiency is high, but when the load is relatively small, it is not It is stable, so it is suitable for high-voltage series.", "label": 0}, {"sentence": "Analyze the existing supercapacitor chargers. Generally, two sets of independently controlled high-power charging power supply are set inside the circuit, one set for PWM pulse The pulse width control working mode starts to charge the supercapacitor when the DCOV is low voltage; the other is the PFM pulse frequency control working mode, which can charge the supercapacitor under the high voltage state, and the two sets of charging power supplies can be charged through the separate control system. Convert each other under different working states to complete the charging process of the super capacitor from DCOV to DC850V. ", "label": 0}, {"sentence": "This kind of circuit has higher design cost and more complicated control. The two internal power supplies need to be converted during charging, and the response speed of the whole loop is slow; the secondary rectifier diode Soft switching cannot be achieved, the stability and conversion efficiency are relatively low, and the product is large in size, which limits the use in some occasions to a certain extent. ", "label": 0}, {"sentence": "Summary of the invention: The purpose of the present invention is to provide an AC/DC charger for electric vehicles to solve the problems raised in the above background technology. ", "label": 0}, {"sentence": "In order to achieve the above purpose, the present invention provides the following technical solutions: an AC/DC charger for electric vehicles, including a controller, a temperature compensation circuit, a power counting circuit, an AC/DC charger, and a DC DC output circuit, auxiliary current circuit, filter circuit, power factor compensation circuit, resonant conversion circuit and battery charge and discharge parameter detection circuit, the controller is respectively connected with temperature compensation circuit, power counting circuit, AC/DC DC output circuit, auxiliary Current circuit, filter circuit, power factor compensation circuit, resonance conversion circuit, battery charge and discharge parameter detection circuit and power module. ", "label": 0}, {"sentence": "As a further solution of the present invention: the battery charge and discharge parameter detection circuit is also connected to a power battery. ", "label": 0}, {"sentence": "As a further scheme of the present invention: the power factor compensation circuit includes an anti-interference filter circuit, a rectifier circuit, a boost circuit and a power factor correction circuit, and is characterized in that: The anti-interference filter circuit includes a capacitor C1, a capacitor C2 and an inductor L1, the rectifier circuit includes a rectifier bridge Q and an inductor L2, the boost circuit includes a transformer T and a resistor R4, and the power factor correction circuit includes chips U1 and MOS tube; one end of the capacitor C1 is respectively connected to the fuse FU and the inductor L1, the other end of the capacitor C1 is respectively connected to the inductor L2 and the 220V AC power supply, the other end of the 220V AC power supply is connected to the other end of the fuse FU, and the other end of the inductor L1 is respectively connected to The capacitor C2 and the rectifier bridge Q port 1, the rectifier bridge Q port 4 are grounded, the rectifier bridge Q port 3 is respectively connected to the other end of the capacitor C2 and the other end of the inductor L2, and the rectifier bridge Q port 2 is respectively connected to the transformer T winding L3, resistor R1, resistor R3 and capacitor C3, the other end of the transformer T winding L3 is connected to the diode D2 positive pole and the MOS tube D pole respectively, the diode D2 negative pole is respectively connected to the resistor R8, the positive pole of the capacitor C8 and the load RL, the other end of the resistor R8 is connected to the resistor R9, and the other end of the resistor R9 is connected respectively The negative electrode of capacitor C8, the other end of the load RL, the resistor R7, the capacitor C7, the pin 6 of the chip U1, the negative electrode of the capacitor C5, the capacitor C4, the resistor R2 and the other end of the capacitor C3 are connected to ground, the pin 1 of the chip U1 is connected to the capacitor C6, and the capacitor The other end of C6 is respectively connected to the pin 2 of the chip U1 and the S pole of the MOS transistor, the pin 7 of the chip U1 is connected to the resistor R5, the other end of the resistor R5 is connected to the G pole of the MOS transistor, and the pin 4 of the chip U1 is respectively connected to the other end of the capacitor C7 and resistor R6, the other end of the resistor R6 is connected to the other end of the resistor R7, the pin 5 of the chip U1 is connected to the resistor R4, the other end of the resistor R4 is respectively connected to the transformer T winding L4 and the positive electrode of the diode D1, the other end of the transformer T winding L4 is grounded, the The pin 8 of the chip U1 is respectively connected to the cathode of the diode D1, the anode of the capacitor C5 and the other end of the resistor R3, and the pin 3 of the chip U1 is respectively connected to the other end of the resistor R1, the other end of the resistor R2 and the other end of the capacitor C4. ", "label": 0}, {"sentence": "As a further solution of the present invention: the model of the chip U1 is L6562. ", "label": 0}, {"sentence": "As a further solution of the present invention: the controller adopts a single-chip microcomputer. ", "label": 0}, {"sentence": "Compared with the prior art, the beneficial effects of the present invention are: the present invention adopts different algorithms for charging according to different rechargeable battery types, which improves the charging efficiency and prolongs the charging time. Battery life, improve battery safety. ", "label": 0}, {"sentence": "Specific implementation manner: The technical solutions in the embodiments of the present invention will be described clearly and completely below in conjunction with the accompanying drawings in the embodiments of the present invention. Obviously, the described The embodiments described above are only a part of the embodiments of the present invention, but not all of the embodiments. ", "label": 0}, {"sentence": "Based on the embodiments of the present invention, all other embodiments obtained by those of ordinary skill in the art without creative work are protected by the present invention. scope. ", "label": 0}, {"sentence": "Please refer to Figures 1 to 2. In an embodiment of the present invention, an AC/DC charger for an electric vehicle includes a controller, a temperature compensation circuit, a power counting circuit, an AC /DC DC output circuit, auxiliary current circuit, filter circuit, power factor compensation circuit, resonance conversion circuit and battery charge and discharge parameter detection circuit, the controller is respectively connected to a temperature compensation circuit, a power counting circuit, an AC/DC DC output circuit, Auxiliary current circuit, filter circuit, power factor compensation circuit, resonance conversion circuit, battery charge and discharge parameter detection circuit and power supply module. ", "label": 0}, {"sentence": "The battery charge and discharge parameter detection circuit is also connected to the power battery. ", "label": 0}, {"sentence": "The power factor compensation circuit includes an anti-interference filter circuit, a rectifier circuit, a boost circuit and a power factor correction circuit, and is characterized in that the anti-interference filter circuit includes Capacitor C1, capacitor C2 and inductor L1, the rectifier circuit includes a rectifier bridge Q and an inductor L2, the boost circuit includes a transformer T and a resistor R4, the power factor correction circuit includes a chip U1 and a MOS tube; the capacitor C1 One end is connected to the fuse FU and the inductor L1 respectively, the other end of the capacitor C1 is connected to the inductor L2 and the 220V AC power supply respectively, the other end of the 220V AC power supply is connected to the other end of the fuse FU, and the other end of the inductor L1 is connected to the capacitor C2 and the Q port of the rectifier bridge respectively 1. The Q port 4 of the rectifier bridge is grounded, the Q port 3 of the rectifier bridge is connected to the other end of the capacitor C2 and the other end of the inductor L2, and the Q port 2 of the rectifier bridge is respectively connected to the transformer T winding L3, resistor R1, resistor R3 and capacitor C3, and the transformer T winding The other end of L3 is connected to the anode of diode D2 and the D pole of MOS tube respectively, the cathode of diode D2 is connected to resistor R8, the anode of capacitor C8 and load RL respectively, the other end of resistor R8 is connected to resistor R9, the other end of resistor R9 is connected to the cathode of capacitor C8 and the other end of load RL respectively. One end, resistor R7, capacitor C7, chip U1 pin 6, capacitor C5 negative electrode, capacitor C4, resistor R2 and capacitor C3 and the other ends are connected to ground, the chip U1 pin 1 is connected to capacitor C6, and the other end of capacitor C6 is connected to chip U1 respectively Pin 2 and the S pole of the MOS tube, the pin 7 of the chip U1 is connected to the resistor R5, the other end of the resistor R5 is connected to the G pole of the MOS tube, the pin 4 of the chip U1 is respectively connected to the other end of the capacitor C7 and the resistor R6, and the other end of the resistor R6 is connected. One end is connected to the other end of the resistor R7, the pin 5 of the chip U1 is connected to the resistor R4, the other end of the resistor R4 is connected to the transformer T winding L4 and the positive electrode of the diode D1 respectively, the other end of the transformer T winding L4 is grounded, and the pin 8 of the chip U1 is connected to the The cathode of the diode D1, the anode of the capacitor C5 and the other end of the resistor R3, the pin 3 of the chip U1 is respectively connected to the other end of the resistor R1, the other end of the resistor R2 and the other end of the capacitor C4. ", "label": 0}, {"sentence": "The model of the chip U1 is L6562. ", "label": 0}, {"sentence": "The controller is a microcontroller. ", "label": 0}, {"sentence": "The working principle of the present invention is: the battery charge and discharge parameter detection circuit collects the voltage and current signals of the AC/DC DC output circuit, and sends the signals to the power management system Comparing and amplifying with the built-in reference signal. ", "label": 0}, {"sentence": "The single-chip microcomputer of the present invention is preset with a constant voltage power supply algorithm and various types of battery charging algorithms, and the input interface circuit can automatically detect the type of the battery to be charged. Then the microcontroller controller uses different algorithms to charge according to different rechargeable battery types. ", "label": 0}, {"sentence": "Please refer to Figure 2, capacitor C1, capacitor C2 and inductor L1 form a double π anti-electromagnetic interference filter, the input 220V AC is rectified by the rectifier bridge Q and then converted into a sine Full-wave DC pulsation, as the input of the boost circuit, the function of the capacitor C3 is to filter out the high-frequency signal in the inductor current and reduce the harmonic content in the input current. The rectified sinusoidal full-wave DC voltage passes through R1 and the resistor. The resistor divider network formed by R2 is then input to the multiplier inside the chip U1 through pin 3 of the chip U1 to determine the waveform and phase of the input voltage, and the capacitor C4 is used to filter out the high-frequency interference of the chip pin 3 Signal. ", "label": 0}, {"sentence": "The transformer T winding L4 is used as a high-sensitivity sensor for the primary inductance, and the high-frequency current of the transformer T winding L3 is transmitted to the resistor R4 and converted into a voltage signal, which is sent to the chip U1 Pin 5 uses the overcurrent detection signal. The driving signal of the chip U1 is connected to the G pole of the MOS tube through the resistor R5. The resistor R7 is used as the detection resistor for the current of the transformer coil L4 to sample the current of the MOS tube on the rising edge of the inductor current. One end of R7 is grounded, and the other is connected to the S pole of the MOS tube. At the same time, it is connected to the pin 4 of the chip U1 through the resistor R6. The resistor R9 and the resistor R8 not only form a resistor divider network, but also form a negative feedback loop for the output voltage; capacitor C6 It is connected between pin 1 of chip U1 and pin 2 of chip U1 to form the compensation network of the voltage loop. ", "label": 0}, {"sentence": "It will be apparent to those skilled in the art that the present invention is not limited to the details of the above-described exemplary embodiments, without departing from the spirit or essential characteristics of the present invention , the present invention can be implemented in other specific forms. ", "label": 0}, {"sentence": "Thus, the embodiments should be considered in all respects to be exemplary and non-restrictive, the scope of the invention being determined by the appended rights It is defined by the claims, rather than the description above, and is therefore intended to embrace within the present invention all changes that come within the meaning and range of equivalency of the claims. ", "label": 0}, {"sentence": "Any reference signs in a claim shall not be construed as limiting the claim in question. ", "label": 0}, {"sentence": "In addition, it should be understood that although this specification is described in terms of embodiments, not every For the sake of clarity, those skilled in the art should take the description as a whole, and the technical solutions in each embodiment can also be appropriately combined to form other embodiments that can be understood by those skilled in the art. ", "label": 0}]}